Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg.h
/*
 * SPDX-License-Identifier: MIT
 *
 * Goal:     stm32V873_otg equates.
 */
#pragma once

#include    <stdint.h>

// OTG address definitions
// -----------------------

typedef struct {
    volatile    uint32_t    GOTGCTL;
    volatile    uint32_t    GOTGINT;
    volatile    uint32_t    GAHBCFG;
    volatile    uint32_t    GUSBCFG;
    volatile    uint32_t    GRSTCTL;
        union {
    volatile    uint32_t    GINTSTS;
    volatile    uint32_t    GINTSTS_ALTERNATE1;
        };
        union {
    volatile    uint32_t    GINTMSK;
    volatile    uint32_t    GINTMSK_ALTERNATE1;
        };
        union {
    volatile    uint32_t    GRXSTSR;
    volatile    uint32_t    GRXSTSR_ALTERNATE1;
        };
        union {
    volatile    uint32_t    GRXSTSP;
    volatile    uint32_t    GRXSTSP_ALTERNATE1;
        };
    volatile    uint32_t    GRXFSIZ;
        union {
    volatile    uint32_t    HNPTXFSIZ;
    volatile    uint32_t    DIEPTXF0;
        };
    volatile    uint32_t    HNPTXSTS;
    volatile    uint32_t    RESERVED0[2];
    volatile    uint32_t    GCCFG;
    volatile    uint32_t    CID;
    volatile    uint32_t    RESERVED1[5];
    volatile    uint32_t    GLPMCFG;
    volatile    uint32_t    RESERVED2[42];
    volatile    uint32_t    HPTXFSIZ;
    volatile    uint32_t    DIEPTXF1;
    volatile    uint32_t    DIEPTXF2;
    volatile    uint32_t    DIEPTXF3;
    volatile    uint32_t    DIEPTXF4;
    volatile    uint32_t    DIEPTXF5;
    volatile    uint32_t    DIEPTXF6;
    volatile    uint32_t    DIEPTXF7;
    volatile    uint32_t    DIEPTXF8;
    volatile    uint32_t    RESERVED3[183];
    volatile    uint32_t    HCFG;
    volatile    uint32_t    HFIR;
    volatile    uint32_t    HFNUM;
    volatile    uint32_t    RESERVED4;
    volatile    uint32_t    HPTXSTS;
    volatile    uint32_t    HAINT;
    volatile    uint32_t    HAINTMSK;
    volatile    uint32_t    RESERVED5[9];
    volatile    uint32_t    HPRT;
    volatile    uint32_t    RESERVED6[47];
    volatile    uint32_t    HCCHAR0;
    volatile    uint32_t    HCSPLT0;
    volatile    uint32_t    HCINT0;
    volatile    uint32_t    HCINTMSK0;
    volatile    uint32_t    HCTSIZ0;
    volatile    uint32_t    HCDMA0;
    volatile    uint32_t    RESERVED7[2];
    volatile    uint32_t    HCCHAR1;
    volatile    uint32_t    HCSPLT1;
    volatile    uint32_t    HCINT1;
    volatile    uint32_t    HCINTMSK1;
    volatile    uint32_t    HCTSIZ1;
    volatile    uint32_t    HCDMA1;
    volatile    uint32_t    RESERVED8[2];
    volatile    uint32_t    HCCHAR2;
    volatile    uint32_t    HCSPLT2;
    volatile    uint32_t    HCINT2;
    volatile    uint32_t    HCINTMSK2;
    volatile    uint32_t    HCTSIZ2;
    volatile    uint32_t    HCDMA2;
    volatile    uint32_t    RESERVED9[2];
    volatile    uint32_t    HCCHAR3;
    volatile    uint32_t    HCSPLT3;
    volatile    uint32_t    HCINT3;
    volatile    uint32_t    HCINTMSK3;
    volatile    uint32_t    HCTSIZ3;
    volatile    uint32_t    HCDMA3;
    volatile    uint32_t    RESERVED10[2];
    volatile    uint32_t    HCCHAR4;
    volatile    uint32_t    HCSPLT4;
    volatile    uint32_t    HCINT4;
    volatile    uint32_t    HCINTMSK4;
    volatile    uint32_t    HCTSIZ4;
    volatile    uint32_t    HCDMA4;
    volatile    uint32_t    RESERVED11[2];
    volatile    uint32_t    HCCHAR5;
    volatile    uint32_t    HCSPLT5;
    volatile    uint32_t    HCINT5;
    volatile    uint32_t    HCINTMSK5;
    volatile    uint32_t    HCTSIZ5;
    volatile    uint32_t    HCDMA5;
    volatile    uint32_t    RESERVED12[2];
    volatile    uint32_t    HCCHAR6;
    volatile    uint32_t    HCSPLT6;
    volatile    uint32_t    HCINT6;
    volatile    uint32_t    HCINTMSK6;
    volatile    uint32_t    HCTSIZ6;
    volatile    uint32_t    HCDMA6;
    volatile    uint32_t    RESERVED13[2];
    volatile    uint32_t    HCCHAR7;
    volatile    uint32_t    HCSPLT7;
    volatile    uint32_t    HCINT7;
    volatile    uint32_t    HCINTMSK7;
    volatile    uint32_t    HCTSIZ7;
    volatile    uint32_t    HCDMA7;
    volatile    uint32_t    RESERVED14[2];
    volatile    uint32_t    HCCHAR8;
    volatile    uint32_t    HCSPLT8;
    volatile    uint32_t    HCINT8;
    volatile    uint32_t    HCINTMSK8;
    volatile    uint32_t    HCTSIZ8;
    volatile    uint32_t    HCDMA8;
    volatile    uint32_t    RESERVED15[2];
    volatile    uint32_t    HCCHAR9;
    volatile    uint32_t    HCSPLT9;
    volatile    uint32_t    HCINT9;
    volatile    uint32_t    HCINTMSK9;
    volatile    uint32_t    HCTSIZ9;
    volatile    uint32_t    HCDMA9;
    volatile    uint32_t    RESERVED16[2];
    volatile    uint32_t    HCCHAR10;
    volatile    uint32_t    HCSPLT10;
    volatile    uint32_t    HCINT10;
    volatile    uint32_t    HCINTMSK10;
    volatile    uint32_t    HCTSIZ10;
    volatile    uint32_t    HCDMA10;
    volatile    uint32_t    RESERVED17[2];
    volatile    uint32_t    HCCHAR11;
    volatile    uint32_t    HCSPLT11;
    volatile    uint32_t    HCINT11;
    volatile    uint32_t    HCINTMSK11;
    volatile    uint32_t    HCTSIZ11;
    volatile    uint32_t    HCDMA11;
    volatile    uint32_t    RESERVED18[2];
    volatile    uint32_t    HCCHAR12;
    volatile    uint32_t    HCSPLT12;
    volatile    uint32_t    HCINT12;
    volatile    uint32_t    HCINTMSK12;
    volatile    uint32_t    HCTSIZ12;
    volatile    uint32_t    HCDMA12;
    volatile    uint32_t    RESERVED19[2];
    volatile    uint32_t    HCCHAR13;
    volatile    uint32_t    HCSPLT13;
    volatile    uint32_t    HCINT13;
    volatile    uint32_t    HCINTMSK13;
    volatile    uint32_t    HCTSIZ13;
    volatile    uint32_t    HCDMA13;
    volatile    uint32_t    RESERVED20[2];
    volatile    uint32_t    HCCHAR14;
    volatile    uint32_t    HCSPLT14;
    volatile    uint32_t    HCINT14;
    volatile    uint32_t    HCINTMSK14;
    volatile    uint32_t    HCTSIZ14;
    volatile    uint32_t    HCDMA14;
    volatile    uint32_t    RESERVED21[2];
    volatile    uint32_t    HCCHAR15;
    volatile    uint32_t    HCSPLT15;
    volatile    uint32_t    HCINT15;
    volatile    uint32_t    HCINTMSK15;
    volatile    uint32_t    HCTSIZ15;
    volatile    uint32_t    HCDMA15;
    volatile    uint32_t    RESERVED22[66];
    volatile    uint32_t    DCFG;
    volatile    uint32_t    DCTL;
    volatile    uint32_t    DSTS;
    volatile    uint32_t    RESERVED23;
    volatile    uint32_t    DIEPMSK;
    volatile    uint32_t    DOEPMSK;
    volatile    uint32_t    DAINT;
    volatile    uint32_t    DAINTMSK;
    volatile    uint32_t    RESERVED24[4];
    volatile    uint32_t    DTHRCTL;
    volatile    uint32_t    DIEPEMPMSK;
    volatile    uint32_t    RESERVED25[50];
        union {
    volatile    uint32_t    DIEPCTL0;
    volatile    uint32_t    DIEPCTL0_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED26;
    volatile    uint32_t    DIEPINT0;
    volatile    uint32_t    RESERVED27;
    volatile    uint32_t    DIEPTSIZ0;
    volatile    uint32_t    DIEPDMA0;
    volatile    uint32_t    DTXFSTS0;
    volatile    uint32_t    RESERVED28;
        union {
    volatile    uint32_t    DIEPCTL1;
    volatile    uint32_t    DIEPCTL1_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED29;
    volatile    uint32_t    DIEPINT1;
    volatile    uint32_t    RESERVED30;
    volatile    uint32_t    DIEPTSIZ1;
    volatile    uint32_t    DIEPDMA1;
    volatile    uint32_t    DTXFSTS1;
    volatile    uint32_t    RESERVED31;
        union {
    volatile    uint32_t    DIEPCTL2;
    volatile    uint32_t    DIEPCTL2_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED32;
    volatile    uint32_t    DIEPINT2;
    volatile    uint32_t    RESERVED33;
    volatile    uint32_t    DIEPTSIZ2;
    volatile    uint32_t    DIEPDMA2;
    volatile    uint32_t    DTXFSTS2;
    volatile    uint32_t    RESERVED34;
        union {
    volatile    uint32_t    DIEPCTL3;
    volatile    uint32_t    DIEPCTL3_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED35;
    volatile    uint32_t    DIEPINT3;
    volatile    uint32_t    RESERVED36;
    volatile    uint32_t    DIEPTSIZ3;
    volatile    uint32_t    DIEPDMA3;
    volatile    uint32_t    DTXFSTS3;
    volatile    uint32_t    RESERVED37;
        union {
    volatile    uint32_t    DIEPCTL4;
    volatile    uint32_t    DIEPCTL4_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED38;
    volatile    uint32_t    DIEPINT4;
    volatile    uint32_t    RESERVED39;
    volatile    uint32_t    DIEPTSIZ4;
    volatile    uint32_t    DIEPDMA4;
    volatile    uint32_t    DTXFSTS4;
    volatile    uint32_t    RESERVED40;
        union {
    volatile    uint32_t    DIEPCTL5;
    volatile    uint32_t    DIEPCTL5_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED41;
    volatile    uint32_t    DIEPINT5;
    volatile    uint32_t    RESERVED42;
    volatile    uint32_t    DIEPTSIZ5;
    volatile    uint32_t    DIEPDMA5;
    volatile    uint32_t    DTXFSTS5;
    volatile    uint32_t    RESERVED43;
        union {
    volatile    uint32_t    DIEPCTL6;
    volatile    uint32_t    DIEPCTL6_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED44;
    volatile    uint32_t    DIEPINT6;
    volatile    uint32_t    RESERVED45;
    volatile    uint32_t    DIEPTSIZ6;
    volatile    uint32_t    DIEPDMA6;
    volatile    uint32_t    DTXFSTS6;
    volatile    uint32_t    RESERVED46;
        union {
    volatile    uint32_t    DIEPCTL7;
    volatile    uint32_t    DIEPCTL7_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED47;
    volatile    uint32_t    DIEPINT7;
    volatile    uint32_t    RESERVED48;
    volatile    uint32_t    DIEPTSIZ7;
    volatile    uint32_t    DIEPDMA7;
    volatile    uint32_t    DTXFSTS7;
    volatile    uint32_t    RESERVED49;
        union {
    volatile    uint32_t    DIEPCTL8;
    volatile    uint32_t    DIEPCTL8_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED50;
    volatile    uint32_t    DIEPINT8;
    volatile    uint32_t    RESERVED51;
    volatile    uint32_t    DIEPTSIZ8;
    volatile    uint32_t    DIEPDMA8;
    volatile    uint32_t    DTXFSTS8;
    volatile    uint32_t    RESERVED52[57];
    volatile    uint32_t    DOEPCTL0;
    volatile    uint32_t    RESERVED53;
    volatile    uint32_t    DOEPINT0;
    volatile    uint32_t    RESERVED54;
    volatile    uint32_t    DOEPTSIZ0;
    volatile    uint32_t    DOEPDMA0;
    volatile    uint32_t    RESERVED55[2];
        union {
    volatile    uint32_t    DOEPCTL1;
    volatile    uint32_t    DOEPCTL1_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED56;
    volatile    uint32_t    DOEPINT1;
    volatile    uint32_t    RESERVED57;
    volatile    uint32_t    DOEPTSIZ1;
    volatile    uint32_t    DOEPDMA1;
    volatile    uint32_t    RESERVED58[2];
        union {
    volatile    uint32_t    DOEPCTL2;
    volatile    uint32_t    DOEPCTL2_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED59;
    volatile    uint32_t    DOEPINT2;
    volatile    uint32_t    RESERVED60;
    volatile    uint32_t    DOEPTSIZ2;
    volatile    uint32_t    DOEPDMA2;
    volatile    uint32_t    RESERVED61[2];
        union {
    volatile    uint32_t    DOEPCTL3;
    volatile    uint32_t    DOEPCTL3_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED62;
    volatile    uint32_t    DOEPINT3;
    volatile    uint32_t    RESERVED63;
    volatile    uint32_t    DOEPTSIZ3;
    volatile    uint32_t    DOEPDMA3;
    volatile    uint32_t    RESERVED64[2];
        union {
    volatile    uint32_t    DOEPCTL4;
    volatile    uint32_t    DOEPCTL4_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED65;
    volatile    uint32_t    DOEPINT4;
    volatile    uint32_t    RESERVED66;
    volatile    uint32_t    DOEPTSIZ4;
    volatile    uint32_t    DOEPDMA4;
    volatile    uint32_t    RESERVED67[2];
        union {
    volatile    uint32_t    DOEPCTL5;
    volatile    uint32_t    DOEPCTL5_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED68;
    volatile    uint32_t    DOEPINT5;
    volatile    uint32_t    RESERVED69;
    volatile    uint32_t    DOEPTSIZ5;
    volatile    uint32_t    DOEPDMA5;
    volatile    uint32_t    RESERVED70[2];
        union {
    volatile    uint32_t    DOEPCTL6;
    volatile    uint32_t    DOEPCTL6_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED71;
    volatile    uint32_t    DOEPINT6;
    volatile    uint32_t    RESERVED72;
    volatile    uint32_t    DOEPTSIZ6;
    volatile    uint32_t    DOEPDMA6;
    volatile    uint32_t    RESERVED73[2];
        union {
    volatile    uint32_t    DOEPCTL7;
    volatile    uint32_t    DOEPCTL7_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED74;
    volatile    uint32_t    DOEPINT7;
    volatile    uint32_t    RESERVED75;
    volatile    uint32_t    DOEPTSIZ7;
    volatile    uint32_t    DOEPDMA7;
    volatile    uint32_t    RESERVED76[2];
        union {
    volatile    uint32_t    DOEPCTL8;
    volatile    uint32_t    DOEPCTL8_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED77;
    volatile    uint32_t    DOEPINT8;
    volatile    uint32_t    RESERVED78;
    volatile    uint32_t    DOEPTSIZ8;
    volatile    uint32_t    DOEPDMA8;
    volatile    uint32_t    RESERVED79[122];
    volatile    uint32_t    PCGCCTL;
    volatile    uint32_t    PCGCCTL1;
} OTG_TypeDef;

#if (defined(__cplusplus))
#define OTG_NS  reinterpret_cast<OTG_TypeDef *>(0x48080000u)
#define OTG_S   reinterpret_cast<OTG_TypeDef *>(0x58080000u)

#else
#define OTG_NS  ((OTG_TypeDef *)0x48080000u)
#define OTG_S   ((OTG_TypeDef *)0x58080000u)
#endif

