Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg.h
// GOTGCTL Configuration

#define OTG_GOTGCTL_CURMOD                                      (0x1u<<21)
#define OTG_GOTGCTL_OTGVER                                      (0x1u<<20)
#define OTG_GOTGCTL_BSVLD                                       (0x1u<<19)
#define OTG_GOTGCTL_ASVLD                                       (0x1u<<18)
#define OTG_GOTGCTL_DBCT                                        (0x1u<<17)
#define OTG_GOTGCTL_CIDSTS                                      (0x1u<<16)
#define OTG_GOTGCTL_EHEN                                        (0x1u<<12)
#define OTG_GOTGCTL_BVALOVAL                                    (0x1u<<7)
#define OTG_GOTGCTL_BVALOEN                                     (0x1u<<6)
#define OTG_GOTGCTL_AVALOVAL                                    (0x1u<<5)
#define OTG_GOTGCTL_AVALOEN                                     (0x1u<<4)
#define OTG_GOTGCTL_VBVALOVAL                                   (0x1u<<3)
#define OTG_GOTGCTL_VBVALOEN                                    (0x1u<<2)

#define OTG_GOTGCTL_CURMOD_B_0X0                                (0x0u<<21)
#define OTG_GOTGCTL_CURMOD_B_0X1                                (0x1u<<21)
#define OTG_GOTGCTL_OTGVER_B_0X0                                (0x0u<<20)
#define OTG_GOTGCTL_OTGVER_B_0X1                                (0x1u<<20)
#define OTG_GOTGCTL_BSVLD_B_0X0                                 (0x0u<<19)
#define OTG_GOTGCTL_BSVLD_B_0X1                                 (0x1u<<19)
#define OTG_GOTGCTL_ASVLD_B_0X0                                 (0x0u<<18)
#define OTG_GOTGCTL_ASVLD_B_0X1                                 (0x1u<<18)
#define OTG_GOTGCTL_DBCT_B_0X0                                  (0x0u<<17)
#define OTG_GOTGCTL_DBCT_B_0X1                                  (0x1u<<17)
#define OTG_GOTGCTL_CIDSTS_B_0X0                                (0x0u<<16)
#define OTG_GOTGCTL_CIDSTS_B_0X1                                (0x1u<<16)
#define OTG_GOTGCTL_EHEN_B_0X0                                  (0x0u<<12)
#define OTG_GOTGCTL_EHEN_B_0X1                                  (0x1u<<12)
#define OTG_GOTGCTL_BVALOVAL_B_0X0                              (0x0u<<7)
#define OTG_GOTGCTL_BVALOVAL_B_0X1                              (0x1u<<7)
#define OTG_GOTGCTL_BVALOEN_B_0X0                               (0x0u<<6)
#define OTG_GOTGCTL_AVALOVAL_B_0X0                              (0x0u<<5)
#define OTG_GOTGCTL_AVALOVAL_B_0X1                              (0x1u<<5)
#define OTG_GOTGCTL_AVALOEN_B_0X0                               (0x0u<<4)
#define OTG_GOTGCTL_AVALOEN_B_0X1                               (0x1u<<4)
#define OTG_GOTGCTL_VBVALOVAL_B_0X0                             (0x0u<<3)
#define OTG_GOTGCTL_VBVALOVAL_B_0X1                             (0x1u<<3)
#define OTG_GOTGCTL_VBVALOEN_B_0X0                              (0x0u<<2)
#define OTG_GOTGCTL_VBVALOEN_B_0X1                              (0x1u<<2)

// GOTGINT Configuration

#define OTG_GOTGINT_ADTOCHG                                     (0x1u<<18)
#define OTG_GOTGINT_SEDET                                       (0x1u<<2)

// GAHBCFG Configuration

#define OTG_GAHBCFG_PTXFELVL                                    (0x1u<<8)
#define OTG_GAHBCFG_TXFELVL                                     (0x1u<<7)
#define OTG_GAHBCFG_DMAEN                                       (0x1u<<5)
#define OTG_GAHBCFG_HBSTLEN                                     (0xFu<<1)
#define OTG_GAHBCFG_HBSTLEN_0                                   (0x1u<<1)
#define OTG_GAHBCFG_GINTMSK                                     (0x1u<<0)

#define OTG_GAHBCFG_PTXFELVL_B_0X0                              (0x0u<<8)
#define OTG_GAHBCFG_PTXFELVL_B_0X1                              (0x1u<<8)
#define OTG_GAHBCFG_TXFELVL_B_0X0_DEVICE_MODE                   (0x0u<<7)
#define OTG_GAHBCFG_TXFELVL_B_0X1_DEVICE_MODE                   (0x1u<<7)
#define OTG_GAHBCFG_DMAEN_B_0X0                                 (0x0u<<5)
#define OTG_GAHBCFG_DMAEN_B_0X1                                 (0x1u<<5)
#define OTG_GAHBCFG_GINTMSK_B_0X0                               (0x0u<<0)
#define OTG_GAHBCFG_GINTMSK_B_0X1                               (0x1u<<0)

// GUSBCFG Configuration

#define OTG_GUSBCFG_FDMOD                                       (0x1u<<30)
#define OTG_GUSBCFG_FHMOD                                       (0x1u<<29)
#define OTG_GUSBCFG_TSDPS                                       (0x1u<<22)
#define OTG_GUSBCFG_PHYLPC                                      (0x1u<<15)
#define OTG_GUSBCFG_TRDT                                        (0xFu<<10)
#define OTG_GUSBCFG_TRDT_0                                      (0x1u<<10)
#define OTG_GUSBCFG_TOCAL                                       (0x7u<<0)
#define OTG_GUSBCFG_TOCAL_0                                     (0x1u<<0)

#define OTG_GUSBCFG_FDMOD_B_0X0                                 (0x0u<<30)
#define OTG_GUSBCFG_FDMOD_B_0X1                                 (0x1u<<30)
#define OTG_GUSBCFG_FHMOD_B_0X0                                 (0x0u<<29)
#define OTG_GUSBCFG_FHMOD_B_0X1                                 (0x1u<<29)
#define OTG_GUSBCFG_TSDPS_B_0X0                                 (0x0u<<22)
#define OTG_GUSBCFG_TSDPS_B_0X1                                 (0x1u<<22)
#define OTG_GUSBCFG_PHYLPC_B_0X0                                (0x0u<<15)
#define OTG_GUSBCFG_PHYLPC_B_0X1                                (0x1u<<15)

// GRSTCTL Configuration

#define OTG_GRSTCTL_AHBIDL                                      (0x1u<<31)
#define OTG_GRSTCTL_DMAREQ                                      (0x1u<<30)
#define OTG_GRSTCTL_CSRSTDONE                                   (0x1u<<29)
#define OTG_GRSTCTL_TXFNUM                                      (0x1Fu<<6)
#define OTG_GRSTCTL_TXFNUM_0                                    (0x1u<<6)
#define OTG_GRSTCTL_TXFFLSH                                     (0x1u<<5)
#define OTG_GRSTCTL_RXFFLSH                                     (0x1u<<4)
#define OTG_GRSTCTL_FCRST                                       (0x1u<<2)
#define OTG_GRSTCTL_PSRST                                       (0x1u<<1)
#define OTG_GRSTCTL_CSRST                                       (0x1u<<0)

#define OTG_GRSTCTL_CSRSTDONE_B_0X0                             (0x0u<<29)
#define OTG_GRSTCTL_CSRSTDONE_B_0X1                             (0x1u<<29)
#define OTG_GRSTCTL_TXFNUM_B_0X0_HOST_MODE                      (0x0u<<6)
#define OTG_GRSTCTL_TXFNUM_B_0X1_HOST_MODE                      (0x1u<<6)
#define OTG_GRSTCTL_TXFNUM_B_0X10_HOST_MODE                     (0x10u<<6)
#define OTG_GRSTCTL_TXFNUM_B_0X2_DEVICE_MODE                    (0x2u<<6)
#define OTG_GRSTCTL_TXFNUM_B_0XF_DEVICE_MODE                    (0xFu<<6)

// GINTSTS Configuration

#define OTG_GINTSTS_WKUPINT                                     (0x1u<<31)
#define OTG_GINTSTS_SRQINT                                      (0x1u<<30)
#define OTG_GINTSTS_DISCINT                                     (0x1u<<29)
#define OTG_GINTSTS_CIDSCHG                                     (0x1u<<28)
#define OTG_GINTSTS_LPMINT                                      (0x1u<<27)
#define OTG_GINTSTS_PTXFE                                       (0x1u<<26)
#define OTG_GINTSTS_HCINT                                       (0x1u<<25)
#define OTG_GINTSTS_HPRTINT                                     (0x1u<<24)
#define OTG_GINTSTS_RSTDET                                      (0x1u<<23)
#define OTG_GINTSTS_DATAFSUSP                                   (0x1u<<22)
#define OTG_GINTSTS_IPXFR                                       (0x1u<<21)
#define OTG_GINTSTS_IISOIXFR                                    (0x1u<<20)
#define OTG_GINTSTS_OEPINT                                      (0x1u<<19)
#define OTG_GINTSTS_IEPINT                                      (0x1u<<18)
#define OTG_GINTSTS_EOPF                                        (0x1u<<15)
#define OTG_GINTSTS_ISOODRP                                     (0x1u<<14)
#define OTG_GINTSTS_ENUMDNE                                     (0x1u<<13)
#define OTG_GINTSTS_USBRST                                      (0x1u<<12)
#define OTG_GINTSTS_USBSUSP                                     (0x1u<<11)
#define OTG_GINTSTS_ESUSP                                       (0x1u<<10)
#define OTG_GINTSTS_GONAKEFF                                    (0x1u<<7)
#define OTG_GINTSTS_GINAKEFF                                    (0x1u<<6)
#define OTG_GINTSTS_NPTXFE                                      (0x1u<<5)
#define OTG_GINTSTS_RXFLVL                                      (0x1u<<4)
#define OTG_GINTSTS_SOF                                         (0x1u<<3)
#define OTG_GINTSTS_OTGINT                                      (0x1u<<2)
#define OTG_GINTSTS_MMIS                                        (0x1u<<1)
#define OTG_GINTSTS_CMOD                                        (0x1u<<0)

