Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg.h
// GRXSTSR Configuration

#define OTG_GRXSTSR_STSPHST                                     (0x1u<<27)
#define OTG_GRXSTSR_FRMNUM                                      (0xFu<<21)
#define OTG_GRXSTSR_FRMNUM_0                                    (0x1u<<21)
#define OTG_GRXSTSR_PKTSTS                                      (0xFu<<17)
#define OTG_GRXSTSR_PKTSTS_0                                    (0x1u<<17)
#define OTG_GRXSTSR_DPID                                        (0x3u<<15)
#define OTG_GRXSTSR_DPID_0                                      (0x1u<<15)
#define OTG_GRXSTSR_BCNT                                        (0x7FFu<<4)
#define OTG_GRXSTSR_BCNT_0                                      (0x1u<<4)
#define OTG_GRXSTSR_EPNUM                                       (0xFu<<0)
#define OTG_GRXSTSR_EPNUM_0                                     (0x1u<<0)

#define OTG_GRXSTSR_PKTSTS_B_0X1                                (0x1u<<17)
#define OTG_GRXSTSR_PKTSTS_B_0X2                                (0x2u<<17)
#define OTG_GRXSTSR_PKTSTS_B_0X3                                (0x3u<<17)
#define OTG_GRXSTSR_PKTSTS_B_0X4                                (0x4u<<17)
#define OTG_GRXSTSR_PKTSTS_B_0X6                                (0x6u<<17)
#define OTG_GRXSTSR_DPID_B_0X0                                  (0x0u<<15)
#define OTG_GRXSTSR_DPID_B_0X2                                  (0x2u<<15)
#define OTG_GRXSTSR_DPID_B_0X1                                  (0x1u<<15)
#define OTG_GRXSTSR_DPID_B_0X3                                  (0x3u<<15)

// GRXSTSR_ALTERNATE1 Configuration

#define OTG_GRXSTSR_ALTERNATE1_PKTSTS                           (0xFu<<17)
#define OTG_GRXSTSR_ALTERNATE1_PKTSTS_0                         (0x1u<<17)
#define OTG_GRXSTSR_ALTERNATE1_DPID                             (0x3u<<15)
#define OTG_GRXSTSR_ALTERNATE1_DPID_0                           (0x1u<<15)
#define OTG_GRXSTSR_ALTERNATE1_BCNT                             (0x7FFu<<4)
#define OTG_GRXSTSR_ALTERNATE1_BCNT_0                           (0x1u<<4)
#define OTG_GRXSTSR_ALTERNATE1_CHNUM                            (0xFu<<0)
#define OTG_GRXSTSR_ALTERNATE1_CHNUM_0                          (0x1u<<0)

#define OTG_GRXSTSR_ALTERNATE1_PKTSTS_B_0X2                     (0x2u<<17)
#define OTG_GRXSTSR_ALTERNATE1_PKTSTS_B_0X3                     (0x3u<<17)
#define OTG_GRXSTSR_ALTERNATE1_PKTSTS_B_0X5                     (0x5u<<17)
#define OTG_GRXSTSR_ALTERNATE1_PKTSTS_B_0X7                     (0x7u<<17)
#define OTG_GRXSTSR_ALTERNATE1_DPID_B_0X0                       (0x0u<<15)
#define OTG_GRXSTSR_ALTERNATE1_DPID_B_0X2                       (0x2u<<15)
#define OTG_GRXSTSR_ALTERNATE1_DPID_B_0X1                       (0x1u<<15)
#define OTG_GRXSTSR_ALTERNATE1_DPID_B_0X3                       (0x3u<<15)

// GRXSTSP Configuration

#define OTG_GRXSTSP_STSPHST                                     (0x1u<<27)
#define OTG_GRXSTSP_FRMNUM                                      (0xFu<<21)
#define OTG_GRXSTSP_FRMNUM_0                                    (0x1u<<21)
#define OTG_GRXSTSP_PKTSTS                                      (0xFu<<17)
#define OTG_GRXSTSP_PKTSTS_0                                    (0x1u<<17)
#define OTG_GRXSTSP_DPID                                        (0x3u<<15)
#define OTG_GRXSTSP_DPID_0                                      (0x1u<<15)
#define OTG_GRXSTSP_BCNT                                        (0x7FFu<<4)
#define OTG_GRXSTSP_BCNT_0                                      (0x1u<<4)
#define OTG_GRXSTSP_EPNUM                                       (0xFu<<0)
#define OTG_GRXSTSP_EPNUM_0                                     (0x1u<<0)

#define OTG_GRXSTSP_PKTSTS_B_0X1                                (0x1u<<17)
#define OTG_GRXSTSP_PKTSTS_B_0X2                                (0x2u<<17)
#define OTG_GRXSTSP_PKTSTS_B_0X3                                (0x3u<<17)
#define OTG_GRXSTSP_PKTSTS_B_0X4                                (0x4u<<17)
#define OTG_GRXSTSP_PKTSTS_B_0X6                                (0x6u<<17)
#define OTG_GRXSTSP_DPID_B_0X0                                  (0x0u<<15)
#define OTG_GRXSTSP_DPID_B_0X2                                  (0x2u<<15)
#define OTG_GRXSTSP_DPID_B_0X1                                  (0x1u<<15)
#define OTG_GRXSTSP_DPID_B_0X3                                  (0x3u<<15)

// GRXSTSP_ALTERNATE1 Configuration

#define OTG_GRXSTSP_ALTERNATE1_PKTSTS                           (0xFu<<17)
#define OTG_GRXSTSP_ALTERNATE1_PKTSTS_0                         (0x1u<<17)
#define OTG_GRXSTSP_ALTERNATE1_DPID                             (0x3u<<15)
#define OTG_GRXSTSP_ALTERNATE1_DPID_0                           (0x1u<<15)
#define OTG_GRXSTSP_ALTERNATE1_BCNT                             (0x7FFu<<4)
#define OTG_GRXSTSP_ALTERNATE1_BCNT_0                           (0x1u<<4)
#define OTG_GRXSTSP_ALTERNATE1_CHNUM                            (0xFu<<0)
#define OTG_GRXSTSP_ALTERNATE1_CHNUM_0                          (0x1u<<0)

#define OTG_GRXSTSP_ALTERNATE1_PKTSTS_B_0X2                     (0x2u<<17)
#define OTG_GRXSTSP_ALTERNATE1_PKTSTS_B_0X3                     (0x3u<<17)
#define OTG_GRXSTSP_ALTERNATE1_PKTSTS_B_0X5                     (0x5u<<17)
#define OTG_GRXSTSP_ALTERNATE1_PKTSTS_B_0X7                     (0x7u<<17)
#define OTG_GRXSTSP_ALTERNATE1_DPID_B_0X0                       (0x0u<<15)
#define OTG_GRXSTSP_ALTERNATE1_DPID_B_0X2                       (0x2u<<15)
#define OTG_GRXSTSP_ALTERNATE1_DPID_B_0X1                       (0x1u<<15)
#define OTG_GRXSTSP_ALTERNATE1_DPID_B_0X3                       (0x3u<<15)

// GRXFSIZ Configuration

#define OTG_GRXFSIZ_RXFD                                        (0xFFFFu<<0)
#define OTG_GRXFSIZ_RXFD_0                                      (0x1u<<0)

// HNPTXFSIZ Configuration

#define OTG_HNPTXFSIZ_NPTXFD                                    (0xFFFFu<<16)
#define OTG_HNPTXFSIZ_NPTXFD_0                                  (0x1u<<16)
#define OTG_HNPTXFSIZ_NPTXFSA                                   (0xFFFFu<<0)
#define OTG_HNPTXFSIZ_NPTXFSA_0                                 (0x1u<<0)

