Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg.h
// HPTXFSIZ Configuration

#define OTG_HPTXFSIZ_PTXFSIZ                                    (0xFFFFu<<16)
#define OTG_HPTXFSIZ_PTXFSIZ_0                                  (0x1u<<16)
#define OTG_HPTXFSIZ_PTXSA                                      (0xFFFFu<<0)
#define OTG_HPTXFSIZ_PTXSA_0                                    (0x1u<<0)

// DIEPTXF1 Configuration

#define OTG_DIEPTXF1_INEPTXFD                                   (0xFFFFu<<16)
#define OTG_DIEPTXF1_INEPTXFD_0                                 (0x1u<<16)
#define OTG_DIEPTXF1_INEPTXSA                                   (0xFFFFu<<0)
#define OTG_DIEPTXF1_INEPTXSA_0                                 (0x1u<<0)

// DIEPTXF2 Configuration

#define OTG_DIEPTXF2_INEPTXFD                                   (0xFFFFu<<16)
#define OTG_DIEPTXF2_INEPTXFD_0                                 (0x1u<<16)
#define OTG_DIEPTXF2_INEPTXSA                                   (0xFFFFu<<0)
#define OTG_DIEPTXF2_INEPTXSA_0                                 (0x1u<<0)

// DIEPTXF3 Configuration

#define OTG_DIEPTXF3_INEPTXFD                                   (0xFFFFu<<16)
#define OTG_DIEPTXF3_INEPTXFD_0                                 (0x1u<<16)
#define OTG_DIEPTXF3_INEPTXSA                                   (0xFFFFu<<0)
#define OTG_DIEPTXF3_INEPTXSA_0                                 (0x1u<<0)

// DIEPTXF4 Configuration

#define OTG_DIEPTXF4_INEPTXFD                                   (0xFFFFu<<16)
#define OTG_DIEPTXF4_INEPTXFD_0                                 (0x1u<<16)
#define OTG_DIEPTXF4_INEPTXSA                                   (0xFFFFu<<0)
#define OTG_DIEPTXF4_INEPTXSA_0                                 (0x1u<<0)

// DIEPTXF5 Configuration

#define OTG_DIEPTXF5_INEPTXFD                                   (0xFFFFu<<16)
#define OTG_DIEPTXF5_INEPTXFD_0                                 (0x1u<<16)
#define OTG_DIEPTXF5_INEPTXSA                                   (0xFFFFu<<0)
#define OTG_DIEPTXF5_INEPTXSA_0                                 (0x1u<<0)

// DIEPTXF6 Configuration

#define OTG_DIEPTXF6_INEPTXFD                                   (0xFFFFu<<16)
#define OTG_DIEPTXF6_INEPTXFD_0                                 (0x1u<<16)
#define OTG_DIEPTXF6_INEPTXSA                                   (0xFFFFu<<0)
#define OTG_DIEPTXF6_INEPTXSA_0                                 (0x1u<<0)

// DIEPTXF7 Configuration

#define OTG_DIEPTXF7_INEPTXFD                                   (0xFFFFu<<16)
#define OTG_DIEPTXF7_INEPTXFD_0                                 (0x1u<<16)
#define OTG_DIEPTXF7_INEPTXSA                                   (0xFFFFu<<0)
#define OTG_DIEPTXF7_INEPTXSA_0                                 (0x1u<<0)

// DIEPTXF8 Configuration

#define OTG_DIEPTXF8_INEPTXFD                                   (0xFFFFu<<16)
#define OTG_DIEPTXF8_INEPTXFD_0                                 (0x1u<<16)
#define OTG_DIEPTXF8_INEPTXSA                                   (0xFFFFu<<0)
#define OTG_DIEPTXF8_INEPTXSA_0                                 (0x1u<<0)

// HCFG Configuration

#define OTG_HCFG_FSLSS                                          (0x1u<<2)
#define OTG_HCFG_FSLSPCS                                        (0x3u<<0)
#define OTG_HCFG_FSLSPCS_0                                      (0x1u<<0)

#define OTG_HCFG_FSLSPCS_B_0X1_FS_HOST_MODE                     (0x1u<<0)
#define OTG_HCFG_FSLSPCS_B_0X2_LS_HOST_MODE                     (0x2u<<0)

// HFIR Configuration

#define OTG_HFIR_RLDCTRL                                        (0x1u<<16)
#define OTG_HFIR_FRIVL                                          (0xFFFFu<<0)
#define OTG_HFIR_FRIVL_0                                        (0x1u<<0)

#define OTG_HFIR_RLDCTRL_B_0X0                                  (0x0u<<16)
#define OTG_HFIR_RLDCTRL_B_0X1                                  (0x1u<<16)

// HFNUM Configuration

#define OTG_HFNUM_FTREM                                         (0xFFFFu<<16)
#define OTG_HFNUM_FTREM_0                                       (0x1u<<16)
#define OTG_HFNUM_FRNUM                                         (0xFFFFu<<0)
#define OTG_HFNUM_FRNUM_0                                       (0x1u<<0)

// HPTXSTS Configuration

#define OTG_HPTXSTS_PTXQTOP                                     (0xFFu<<24)
#define OTG_HPTXSTS_PTXQTOP_0                                   (0x1u<<24)
#define OTG_HPTXSTS_PTXQSAV                                     (0xFFu<<16)
#define OTG_HPTXSTS_PTXQSAV_0                                   (0x1u<<16)
#define OTG_HPTXSTS_PTXFSAVL                                    (0xFFFFu<<0)
#define OTG_HPTXSTS_PTXFSAVL_0                                  (0x1u<<0)

#define OTG_HPTXSTS_PTXQSAV_B_0X0                               (0x0u<<16)
#define OTG_HPTXSTS_PTXQSAV_B_0X1                               (0x1u<<16)
#define OTG_HPTXSTS_PTXFSAVL_B_0X0                              (0x0u<<0)
#define OTG_HPTXSTS_PTXFSAVL_B_0X1                              (0x1u<<0)

// HAINT Configuration

#define OTG_HAINT_HAINT                                         (0xFFFFu<<0)
#define OTG_HAINT_HAINT_0                                       (0x1u<<0)

// HAINTMSK Configuration

#define OTG_HAINTMSK_HAINTM                                     (0xFFFFu<<0)
#define OTG_HAINTMSK_HAINTM_0                                   (0x1u<<0)

#define OTG_HAINTMSK_HAINTM_B_0X0                               (0x0u<<0)
#define OTG_HAINTMSK_HAINTM_B_0X1                               (0x1u<<0)

// HPRT Configuration

#define OTG_HPRT_PSPD                                           (0x3u<<17)
#define OTG_HPRT_PSPD_0                                         (0x1u<<17)
#define OTG_HPRT_PTCTL                                          (0xFu<<13)
#define OTG_HPRT_PTCTL_0                                        (0x1u<<13)
#define OTG_HPRT_PPWR                                           (0x1u<<12)
#define OTG_HPRT_PLSTS                                          (0x3u<<10)
#define OTG_HPRT_PLSTS_0                                        (0x1u<<10)
#define OTG_HPRT_PRST                                           (0x1u<<8)
#define OTG_HPRT_PSUSP                                          (0x1u<<7)
#define OTG_HPRT_PRES                                           (0x1u<<6)
#define OTG_HPRT_POCCHNG                                        (0x1u<<5)
#define OTG_HPRT_POCA                                           (0x1u<<4)
#define OTG_HPRT_PENCHNG                                        (0x1u<<3)
#define OTG_HPRT_PENA                                           (0x1u<<2)
#define OTG_HPRT_PCDET                                          (0x1u<<1)
#define OTG_HPRT_PCSTS                                          (0x1u<<0)

#define OTG_HPRT_PSPD_B_0X1                                     (0x1u<<17)
#define OTG_HPRT_PSPD_B_0X2                                     (0x2u<<17)
#define OTG_HPRT_PSPD_B_0X0                                     (0x0u<<17)
#define OTG_HPRT_PTCTL_B_0X0                                    (0x0u<<13)
#define OTG_HPRT_PTCTL_B_0X1                                    (0x1u<<13)
#define OTG_HPRT_PTCTL_B_0X2                                    (0x2u<<13)
#define OTG_HPRT_PTCTL_B_0X3                                    (0x3u<<13)
#define OTG_HPRT_PTCTL_B_0X4                                    (0x4u<<13)
#define OTG_HPRT_PTCTL_B_0X5                                    (0x5u<<13)
#define OTG_HPRT_PPWR_B_0X0                                     (0x0u<<12)
#define OTG_HPRT_PPWR_B_0X1                                     (0x1u<<12)
#define OTG_HPRT_PRST_B_0X0                                     (0x0u<<8)
#define OTG_HPRT_PRST_B_0X1                                     (0x1u<<8)
#define OTG_HPRT_PSUSP_B_0X0                                    (0x0u<<7)
#define OTG_HPRT_PSUSP_B_0X1                                    (0x1u<<7)
#define OTG_HPRT_PRES_B_0X0                                     (0x0u<<6)
#define OTG_HPRT_PRES_B_0X1                                     (0x1u<<6)
#define OTG_HPRT_POCA_B_0X0                                     (0x0u<<4)
#define OTG_HPRT_POCA_B_0X1                                     (0x1u<<4)
#define OTG_HPRT_PENA_B_0X0                                     (0x0u<<2)
#define OTG_HPRT_PENA_B_0X1                                     (0x1u<<2)
#define OTG_HPRT_PCSTS_B_0X0                                    (0x0u<<0)
#define OTG_HPRT_PCSTS_B_0X1                                    (0x1u<<0)

// HCCHAR0 Configuration

