Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg.h
#define OTG_HCTSIZ1_DOPNG                                       (0x1u<<31)
#define OTG_HCTSIZ1_DPID                                        (0x3u<<29)
#define OTG_HCTSIZ1_DPID_0                                      (0x1u<<29)
#define OTG_HCTSIZ1_PKTCNT                                      (0x3FFu<<19)
#define OTG_HCTSIZ1_PKTCNT_0                                    (0x1u<<19)
#define OTG_HCTSIZ1_XFRSIZ                                      (0x7FFFFu<<0)
#define OTG_HCTSIZ1_XFRSIZ_0                                    (0x1u<<0)

#define OTG_HCTSIZ1_DPID_B_0X0                                  (0x0u<<29)
#define OTG_HCTSIZ1_DPID_B_0X1                                  (0x1u<<29)
#define OTG_HCTSIZ1_DPID_B_0X2                                  (0x2u<<29)
#define OTG_HCTSIZ1_DPID_B_0X3                                  (0x3u<<29)

// HCDMA1 Configuration

#define OTG_HCDMA1_DMAADDR                                      (0xFFFFFFFFu<<0)
#define OTG_HCDMA1_DMAADDR_0                                    (0x1u<<0)

// HCCHAR2 Configuration

#define OTG_HCCHAR2_CHENA                                       (0x1u<<31)
#define OTG_HCCHAR2_CHDIS                                       (0x1u<<30)
#define OTG_HCCHAR2_ODDFRM                                      (0x1u<<29)
#define OTG_HCCHAR2_DAD                                         (0x7Fu<<22)
#define OTG_HCCHAR2_DAD_0                                       (0x1u<<22)
#define OTG_HCCHAR2_MCNT                                        (0x3u<<20)
#define OTG_HCCHAR2_MCNT_0                                      (0x1u<<20)
#define OTG_HCCHAR2_EPTYP                                       (0x3u<<18)
#define OTG_HCCHAR2_EPTYP_0                                     (0x1u<<18)
#define OTG_HCCHAR2_LSDEV                                       (0x1u<<17)
#define OTG_HCCHAR2_EPDIR                                       (0x1u<<15)
#define OTG_HCCHAR2_EPNUM                                       (0xFu<<11)
#define OTG_HCCHAR2_EPNUM_0                                     (0x1u<<11)
#define OTG_HCCHAR2_MPSIZ                                       (0x7FFu<<0)
#define OTG_HCCHAR2_MPSIZ_0                                     (0x1u<<0)

#define OTG_HCCHAR2_CHENA_B_0X0                                 (0x0u<<31)
#define OTG_HCCHAR2_CHENA_B_0X1                                 (0x1u<<31)
#define OTG_HCCHAR2_ODDFRM_B_0X0                                (0x0u<<29)
#define OTG_HCCHAR2_ODDFRM_B_0X1                                (0x1u<<29)
#define OTG_HCCHAR2_MCNT_B_0X0                                  (0x0u<<20)
#define OTG_HCCHAR2_MCNT_B_0X1                                  (0x1u<<20)
#define OTG_HCCHAR2_MCNT_B_0X2                                  (0x2u<<20)
#define OTG_HCCHAR2_MCNT_B_0X3                                  (0x3u<<20)
#define OTG_HCCHAR2_EPTYP_B_0X0                                 (0x0u<<18)
#define OTG_HCCHAR2_EPTYP_B_0X1                                 (0x1u<<18)
#define OTG_HCCHAR2_EPTYP_B_0X2                                 (0x2u<<18)
#define OTG_HCCHAR2_EPTYP_B_0X3                                 (0x3u<<18)
#define OTG_HCCHAR2_EPDIR_B_0X0                                 (0x0u<<15)
#define OTG_HCCHAR2_EPDIR_B_0X1                                 (0x1u<<15)

// HCSPLT2 Configuration

#define OTG_HCSPLT2_SPLITEN                                     (0x1u<<31)
#define OTG_HCSPLT2_COMPLSPLT                                   (0x1u<<16)
#define OTG_HCSPLT2_XACTPOS                                     (0x3u<<14)
#define OTG_HCSPLT2_XACTPOS_0                                   (0x1u<<14)
#define OTG_HCSPLT2_HUBADDR                                     (0x7Fu<<7)
#define OTG_HCSPLT2_HUBADDR_0                                   (0x1u<<7)
#define OTG_HCSPLT2_PRTADDR                                     (0x7Fu<<0)
#define OTG_HCSPLT2_PRTADDR_0                                   (0x1u<<0)

#define OTG_HCSPLT2_XACTPOS_B_0X3                               (0x3u<<14)
#define OTG_HCSPLT2_XACTPOS_B_0X2                               (0x2u<<14)
#define OTG_HCSPLT2_XACTPOS_B_0X0                               (0x0u<<14)
#define OTG_HCSPLT2_XACTPOS_B_0X1                               (0x1u<<14)

// HCINT2 Configuration

#define OTG_HCINT2_DTERR                                        (0x1u<<10)
#define OTG_HCINT2_FRMOR                                        (0x1u<<9)
#define OTG_HCINT2_BBERR                                        (0x1u<<8)
#define OTG_HCINT2_TXERR                                        (0x1u<<7)
#define OTG_HCINT2_NYET                                         (0x1u<<6)
#define OTG_HCINT2_ACK                                          (0x1u<<5)
#define OTG_HCINT2_NAK                                          (0x1u<<4)
#define OTG_HCINT2_STALL                                        (0x1u<<3)
#define OTG_HCINT2_AHBERR                                       (0x1u<<2)
#define OTG_HCINT2_CHH                                          (0x1u<<1)
#define OTG_HCINT2_XFRC                                         (0x1u<<0)

// HCINTMSK2 Configuration

#define OTG_HCINTMSK2_DTERRM                                    (0x1u<<10)
#define OTG_HCINTMSK2_FRMORM                                    (0x1u<<9)
#define OTG_HCINTMSK2_BBERRM                                    (0x1u<<8)
#define OTG_HCINTMSK2_TXERRM                                    (0x1u<<7)
#define OTG_HCINTMSK2_NYET                                      (0x1u<<6)
#define OTG_HCINTMSK2_ACKM                                      (0x1u<<5)
#define OTG_HCINTMSK2_NAKM                                      (0x1u<<4)
#define OTG_HCINTMSK2_STALLM                                    (0x1u<<3)
#define OTG_HCINTMSK2_AHBERRM                                   (0x1u<<2)
#define OTG_HCINTMSK2_CHHM                                      (0x1u<<1)
#define OTG_HCINTMSK2_XFRCM                                     (0x1u<<0)

#define OTG_HCINTMSK2_DTERRM_B_0X0                              (0x0u<<10)
#define OTG_HCINTMSK2_DTERRM_B_0X1                              (0x1u<<10)
#define OTG_HCINTMSK2_FRMORM_B_0X0                              (0x0u<<9)
#define OTG_HCINTMSK2_FRMORM_B_0X1                              (0x1u<<9)
#define OTG_HCINTMSK2_BBERRM_B_0X0                              (0x0u<<8)
#define OTG_HCINTMSK2_BBERRM_B_0X1                              (0x1u<<8)
#define OTG_HCINTMSK2_TXERRM_B_0X0                              (0x0u<<7)
#define OTG_HCINTMSK2_TXERRM_B_0X1                              (0x1u<<7)
#define OTG_HCINTMSK2_NYET_B_0X0                                (0x0u<<6)
#define OTG_HCINTMSK2_NYET_B_0X1                                (0x1u<<6)
#define OTG_HCINTMSK2_ACKM_B_0X0                                (0x0u<<5)
#define OTG_HCINTMSK2_ACKM_B_0X1                                (0x1u<<5)
#define OTG_HCINTMSK2_NAKM_B_0X0                                (0x0u<<4)
#define OTG_HCINTMSK2_NAKM_B_0X1                                (0x1u<<4)
#define OTG_HCINTMSK2_STALLM_B_0X0                              (0x0u<<3)
#define OTG_HCINTMSK2_STALLM_B_0X1                              (0x1u<<3)
#define OTG_HCINTMSK2_AHBERRM_B_0X0                             (0x0u<<2)
#define OTG_HCINTMSK2_AHBERRM_B_0X1                             (0x1u<<2)
#define OTG_HCINTMSK2_CHHM_B_0X0                                (0x0u<<1)
#define OTG_HCINTMSK2_CHHM_B_0X1                                (0x1u<<1)
#define OTG_HCINTMSK2_XFRCM_B_0X0                               (0x0u<<0)
#define OTG_HCINTMSK2_XFRCM_B_0X1                               (0x1u<<0)

