Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg.h
// HCCHAR5 Configuration

#define OTG_HCCHAR5_CHENA                                       (0x1u<<31)
#define OTG_HCCHAR5_CHDIS                                       (0x1u<<30)
#define OTG_HCCHAR5_ODDFRM                                      (0x1u<<29)
#define OTG_HCCHAR5_DAD                                         (0x7Fu<<22)
#define OTG_HCCHAR5_DAD_0                                       (0x1u<<22)
#define OTG_HCCHAR5_MCNT                                        (0x3u<<20)
#define OTG_HCCHAR5_MCNT_0                                      (0x1u<<20)
#define OTG_HCCHAR5_EPTYP                                       (0x3u<<18)
#define OTG_HCCHAR5_EPTYP_0                                     (0x1u<<18)
#define OTG_HCCHAR5_LSDEV                                       (0x1u<<17)
#define OTG_HCCHAR5_EPDIR                                       (0x1u<<15)
#define OTG_HCCHAR5_EPNUM                                       (0xFu<<11)
#define OTG_HCCHAR5_EPNUM_0                                     (0x1u<<11)
#define OTG_HCCHAR5_MPSIZ                                       (0x7FFu<<0)
#define OTG_HCCHAR5_MPSIZ_0                                     (0x1u<<0)

#define OTG_HCCHAR5_CHENA_B_0X0                                 (0x0u<<31)
#define OTG_HCCHAR5_CHENA_B_0X1                                 (0x1u<<31)
#define OTG_HCCHAR5_ODDFRM_B_0X0                                (0x0u<<29)
#define OTG_HCCHAR5_ODDFRM_B_0X1                                (0x1u<<29)
#define OTG_HCCHAR5_MCNT_B_0X0                                  (0x0u<<20)
#define OTG_HCCHAR5_MCNT_B_0X1                                  (0x1u<<20)
#define OTG_HCCHAR5_MCNT_B_0X2                                  (0x2u<<20)
#define OTG_HCCHAR5_MCNT_B_0X3                                  (0x3u<<20)
#define OTG_HCCHAR5_EPTYP_B_0X0                                 (0x0u<<18)
#define OTG_HCCHAR5_EPTYP_B_0X1                                 (0x1u<<18)
#define OTG_HCCHAR5_EPTYP_B_0X2                                 (0x2u<<18)
#define OTG_HCCHAR5_EPTYP_B_0X3                                 (0x3u<<18)
#define OTG_HCCHAR5_EPDIR_B_0X0                                 (0x0u<<15)
#define OTG_HCCHAR5_EPDIR_B_0X1                                 (0x1u<<15)

// HCSPLT5 Configuration

#define OTG_HCSPLT5_SPLITEN                                     (0x1u<<31)
#define OTG_HCSPLT5_COMPLSPLT                                   (0x1u<<16)
#define OTG_HCSPLT5_XACTPOS                                     (0x3u<<14)
#define OTG_HCSPLT5_XACTPOS_0                                   (0x1u<<14)
#define OTG_HCSPLT5_HUBADDR                                     (0x7Fu<<7)
#define OTG_HCSPLT5_HUBADDR_0                                   (0x1u<<7)
#define OTG_HCSPLT5_PRTADDR                                     (0x7Fu<<0)
#define OTG_HCSPLT5_PRTADDR_0                                   (0x1u<<0)

#define OTG_HCSPLT5_XACTPOS_B_0X3                               (0x3u<<14)
#define OTG_HCSPLT5_XACTPOS_B_0X2                               (0x2u<<14)
#define OTG_HCSPLT5_XACTPOS_B_0X0                               (0x0u<<14)
#define OTG_HCSPLT5_XACTPOS_B_0X1                               (0x1u<<14)

// HCINT5 Configuration

#define OTG_HCINT5_DTERR                                        (0x1u<<10)
#define OTG_HCINT5_FRMOR                                        (0x1u<<9)
#define OTG_HCINT5_BBERR                                        (0x1u<<8)
#define OTG_HCINT5_TXERR                                        (0x1u<<7)
#define OTG_HCINT5_NYET                                         (0x1u<<6)
#define OTG_HCINT5_ACK                                          (0x1u<<5)
#define OTG_HCINT5_NAK                                          (0x1u<<4)
#define OTG_HCINT5_STALL                                        (0x1u<<3)
#define OTG_HCINT5_AHBERR                                       (0x1u<<2)
#define OTG_HCINT5_CHH                                          (0x1u<<1)
#define OTG_HCINT5_XFRC                                         (0x1u<<0)

// HCINTMSK5 Configuration

#define OTG_HCINTMSK5_DTERRM                                    (0x1u<<10)
#define OTG_HCINTMSK5_FRMORM                                    (0x1u<<9)
#define OTG_HCINTMSK5_BBERRM                                    (0x1u<<8)
#define OTG_HCINTMSK5_TXERRM                                    (0x1u<<7)
#define OTG_HCINTMSK5_NYET                                      (0x1u<<6)
#define OTG_HCINTMSK5_ACKM                                      (0x1u<<5)
#define OTG_HCINTMSK5_NAKM                                      (0x1u<<4)
#define OTG_HCINTMSK5_STALLM                                    (0x1u<<3)
#define OTG_HCINTMSK5_AHBERRM                                   (0x1u<<2)
#define OTG_HCINTMSK5_CHHM                                      (0x1u<<1)
#define OTG_HCINTMSK5_XFRCM                                     (0x1u<<0)

#define OTG_HCINTMSK5_DTERRM_B_0X0                              (0x0u<<10)
#define OTG_HCINTMSK5_DTERRM_B_0X1                              (0x1u<<10)
#define OTG_HCINTMSK5_FRMORM_B_0X0                              (0x0u<<9)
#define OTG_HCINTMSK5_FRMORM_B_0X1                              (0x1u<<9)
#define OTG_HCINTMSK5_BBERRM_B_0X0                              (0x0u<<8)
#define OTG_HCINTMSK5_BBERRM_B_0X1                              (0x1u<<8)
#define OTG_HCINTMSK5_TXERRM_B_0X0                              (0x0u<<7)
#define OTG_HCINTMSK5_TXERRM_B_0X1                              (0x1u<<7)
#define OTG_HCINTMSK5_NYET_B_0X0                                (0x0u<<6)
#define OTG_HCINTMSK5_NYET_B_0X1                                (0x1u<<6)
#define OTG_HCINTMSK5_ACKM_B_0X0                                (0x0u<<5)
#define OTG_HCINTMSK5_ACKM_B_0X1                                (0x1u<<5)
#define OTG_HCINTMSK5_NAKM_B_0X0                                (0x0u<<4)
#define OTG_HCINTMSK5_NAKM_B_0X1                                (0x1u<<4)
#define OTG_HCINTMSK5_STALLM_B_0X0                              (0x0u<<3)
#define OTG_HCINTMSK5_STALLM_B_0X1                              (0x1u<<3)
#define OTG_HCINTMSK5_AHBERRM_B_0X0                             (0x0u<<2)
#define OTG_HCINTMSK5_AHBERRM_B_0X1                             (0x1u<<2)
#define OTG_HCINTMSK5_CHHM_B_0X0                                (0x0u<<1)
#define OTG_HCINTMSK5_CHHM_B_0X1                                (0x1u<<1)
#define OTG_HCINTMSK5_XFRCM_B_0X0                               (0x0u<<0)
#define OTG_HCINTMSK5_XFRCM_B_0X1                               (0x1u<<0)

// HCTSIZ5 Configuration

