Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg.h
// HCCHAR9 Configuration

#define OTG_HCCHAR9_CHENA                                       (0x1u<<31)
#define OTG_HCCHAR9_CHDIS                                       (0x1u<<30)
#define OTG_HCCHAR9_ODDFRM                                      (0x1u<<29)
#define OTG_HCCHAR9_DAD                                         (0x7Fu<<22)
#define OTG_HCCHAR9_DAD_0                                       (0x1u<<22)
#define OTG_HCCHAR9_MCNT                                        (0x3u<<20)
#define OTG_HCCHAR9_MCNT_0                                      (0x1u<<20)
#define OTG_HCCHAR9_EPTYP                                       (0x3u<<18)
#define OTG_HCCHAR9_EPTYP_0                                     (0x1u<<18)
#define OTG_HCCHAR9_LSDEV                                       (0x1u<<17)
#define OTG_HCCHAR9_EPDIR                                       (0x1u<<15)
#define OTG_HCCHAR9_EPNUM                                       (0xFu<<11)
#define OTG_HCCHAR9_EPNUM_0                                     (0x1u<<11)
#define OTG_HCCHAR9_MPSIZ                                       (0x7FFu<<0)
#define OTG_HCCHAR9_MPSIZ_0                                     (0x1u<<0)

#define OTG_HCCHAR9_CHENA_B_0X0                                 (0x0u<<31)
#define OTG_HCCHAR9_CHENA_B_0X1                                 (0x1u<<31)
#define OTG_HCCHAR9_ODDFRM_B_0X0                                (0x0u<<29)
#define OTG_HCCHAR9_ODDFRM_B_0X1                                (0x1u<<29)
#define OTG_HCCHAR9_MCNT_B_0X0                                  (0x0u<<20)
#define OTG_HCCHAR9_MCNT_B_0X1                                  (0x1u<<20)
#define OTG_HCCHAR9_MCNT_B_0X2                                  (0x2u<<20)
#define OTG_HCCHAR9_MCNT_B_0X3                                  (0x3u<<20)
#define OTG_HCCHAR9_EPTYP_B_0X0                                 (0x0u<<18)
#define OTG_HCCHAR9_EPTYP_B_0X1                                 (0x1u<<18)
#define OTG_HCCHAR9_EPTYP_B_0X2                                 (0x2u<<18)
#define OTG_HCCHAR9_EPTYP_B_0X3                                 (0x3u<<18)
#define OTG_HCCHAR9_EPDIR_B_0X0                                 (0x0u<<15)
#define OTG_HCCHAR9_EPDIR_B_0X1                                 (0x1u<<15)

// HCSPLT9 Configuration

#define OTG_HCSPLT9_SPLITEN                                     (0x1u<<31)
#define OTG_HCSPLT9_COMPLSPLT                                   (0x1u<<16)
#define OTG_HCSPLT9_XACTPOS                                     (0x3u<<14)
#define OTG_HCSPLT9_XACTPOS_0                                   (0x1u<<14)
#define OTG_HCSPLT9_HUBADDR                                     (0x7Fu<<7)
#define OTG_HCSPLT9_HUBADDR_0                                   (0x1u<<7)
#define OTG_HCSPLT9_PRTADDR                                     (0x7Fu<<0)
#define OTG_HCSPLT9_PRTADDR_0                                   (0x1u<<0)

#define OTG_HCSPLT9_XACTPOS_B_0X3                               (0x3u<<14)
#define OTG_HCSPLT9_XACTPOS_B_0X2                               (0x2u<<14)
#define OTG_HCSPLT9_XACTPOS_B_0X0                               (0x0u<<14)
#define OTG_HCSPLT9_XACTPOS_B_0X1                               (0x1u<<14)

// HCINT9 Configuration

#define OTG_HCINT9_DTERR                                        (0x1u<<10)
#define OTG_HCINT9_FRMOR                                        (0x1u<<9)
#define OTG_HCINT9_BBERR                                        (0x1u<<8)
#define OTG_HCINT9_TXERR                                        (0x1u<<7)
#define OTG_HCINT9_NYET                                         (0x1u<<6)
#define OTG_HCINT9_ACK                                          (0x1u<<5)
#define OTG_HCINT9_NAK                                          (0x1u<<4)
#define OTG_HCINT9_STALL                                        (0x1u<<3)
#define OTG_HCINT9_AHBERR                                       (0x1u<<2)
#define OTG_HCINT9_CHH                                          (0x1u<<1)
#define OTG_HCINT9_XFRC                                         (0x1u<<0)

// HCINTMSK9 Configuration

#define OTG_HCINTMSK9_DTERRM                                    (0x1u<<10)
#define OTG_HCINTMSK9_FRMORM                                    (0x1u<<9)
#define OTG_HCINTMSK9_BBERRM                                    (0x1u<<8)
#define OTG_HCINTMSK9_TXERRM                                    (0x1u<<7)
#define OTG_HCINTMSK9_NYET                                      (0x1u<<6)
#define OTG_HCINTMSK9_ACKM                                      (0x1u<<5)
#define OTG_HCINTMSK9_NAKM                                      (0x1u<<4)
#define OTG_HCINTMSK9_STALLM                                    (0x1u<<3)
#define OTG_HCINTMSK9_AHBERRM                                   (0x1u<<2)
#define OTG_HCINTMSK9_CHHM                                      (0x1u<<1)
#define OTG_HCINTMSK9_XFRCM                                     (0x1u<<0)

#define OTG_HCINTMSK9_DTERRM_B_0X0                              (0x0u<<10)
#define OTG_HCINTMSK9_DTERRM_B_0X1                              (0x1u<<10)
#define OTG_HCINTMSK9_FRMORM_B_0X0                              (0x0u<<9)
#define OTG_HCINTMSK9_FRMORM_B_0X1                              (0x1u<<9)
#define OTG_HCINTMSK9_BBERRM_B_0X0                              (0x0u<<8)
#define OTG_HCINTMSK9_BBERRM_B_0X1                              (0x1u<<8)
#define OTG_HCINTMSK9_TXERRM_B_0X0                              (0x0u<<7)
#define OTG_HCINTMSK9_TXERRM_B_0X1                              (0x1u<<7)
#define OTG_HCINTMSK9_NYET_B_0X0                                (0x0u<<6)
#define OTG_HCINTMSK9_NYET_B_0X1                                (0x1u<<6)
#define OTG_HCINTMSK9_ACKM_B_0X0                                (0x0u<<5)
#define OTG_HCINTMSK9_ACKM_B_0X1                                (0x1u<<5)
#define OTG_HCINTMSK9_NAKM_B_0X0                                (0x0u<<4)
#define OTG_HCINTMSK9_NAKM_B_0X1                                (0x1u<<4)
#define OTG_HCINTMSK9_STALLM_B_0X0                              (0x0u<<3)
#define OTG_HCINTMSK9_STALLM_B_0X1                              (0x1u<<3)
#define OTG_HCINTMSK9_AHBERRM_B_0X0                             (0x0u<<2)
#define OTG_HCINTMSK9_AHBERRM_B_0X1                             (0x1u<<2)
#define OTG_HCINTMSK9_CHHM_B_0X0                                (0x0u<<1)
#define OTG_HCINTMSK9_CHHM_B_0X1                                (0x1u<<1)
#define OTG_HCINTMSK9_XFRCM_B_0X0                               (0x0u<<0)
#define OTG_HCINTMSK9_XFRCM_B_0X1                               (0x1u<<0)

// HCTSIZ9 Configuration

