Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg.h
#define OTG_HCSPLT13_XACTPOS_B_0X3                              (0x3u<<14)
#define OTG_HCSPLT13_XACTPOS_B_0X2                              (0x2u<<14)
#define OTG_HCSPLT13_XACTPOS_B_0X0                              (0x0u<<14)
#define OTG_HCSPLT13_XACTPOS_B_0X1                              (0x1u<<14)

// HCINT13 Configuration

#define OTG_HCINT13_DTERR                                       (0x1u<<10)
#define OTG_HCINT13_FRMOR                                       (0x1u<<9)
#define OTG_HCINT13_BBERR                                       (0x1u<<8)
#define OTG_HCINT13_TXERR                                       (0x1u<<7)
#define OTG_HCINT13_NYET                                        (0x1u<<6)
#define OTG_HCINT13_ACK                                         (0x1u<<5)
#define OTG_HCINT13_NAK                                         (0x1u<<4)
#define OTG_HCINT13_STALL                                       (0x1u<<3)
#define OTG_HCINT13_AHBERR                                      (0x1u<<2)
#define OTG_HCINT13_CHH                                         (0x1u<<1)
#define OTG_HCINT13_XFRC                                        (0x1u<<0)

// HCINTMSK13 Configuration

#define OTG_HCINTMSK13_DTERRM                                   (0x1u<<10)
#define OTG_HCINTMSK13_FRMORM                                   (0x1u<<9)
#define OTG_HCINTMSK13_BBERRM                                   (0x1u<<8)
#define OTG_HCINTMSK13_TXERRM                                   (0x1u<<7)
#define OTG_HCINTMSK13_NYET                                     (0x1u<<6)
#define OTG_HCINTMSK13_ACKM                                     (0x1u<<5)
#define OTG_HCINTMSK13_NAKM                                     (0x1u<<4)
#define OTG_HCINTMSK13_STALLM                                   (0x1u<<3)
#define OTG_HCINTMSK13_AHBERRM                                  (0x1u<<2)
#define OTG_HCINTMSK13_CHHM                                     (0x1u<<1)
#define OTG_HCINTMSK13_XFRCM                                    (0x1u<<0)

#define OTG_HCINTMSK13_DTERRM_B_0X0                             (0x0u<<10)
#define OTG_HCINTMSK13_DTERRM_B_0X1                             (0x1u<<10)
#define OTG_HCINTMSK13_FRMORM_B_0X0                             (0x0u<<9)
#define OTG_HCINTMSK13_FRMORM_B_0X1                             (0x1u<<9)
#define OTG_HCINTMSK13_BBERRM_B_0X0                             (0x0u<<8)
#define OTG_HCINTMSK13_BBERRM_B_0X1                             (0x1u<<8)
#define OTG_HCINTMSK13_TXERRM_B_0X0                             (0x0u<<7)
#define OTG_HCINTMSK13_TXERRM_B_0X1                             (0x1u<<7)
#define OTG_HCINTMSK13_NYET_B_0X0                               (0x0u<<6)
#define OTG_HCINTMSK13_NYET_B_0X1                               (0x1u<<6)
#define OTG_HCINTMSK13_ACKM_B_0X0                               (0x0u<<5)
#define OTG_HCINTMSK13_ACKM_B_0X1                               (0x1u<<5)
#define OTG_HCINTMSK13_NAKM_B_0X0                               (0x0u<<4)
#define OTG_HCINTMSK13_NAKM_B_0X1                               (0x1u<<4)
#define OTG_HCINTMSK13_STALLM_B_0X0                             (0x0u<<3)
#define OTG_HCINTMSK13_STALLM_B_0X1                             (0x1u<<3)
#define OTG_HCINTMSK13_AHBERRM_B_0X0                            (0x0u<<2)
#define OTG_HCINTMSK13_AHBERRM_B_0X1                            (0x1u<<2)
#define OTG_HCINTMSK13_CHHM_B_0X0                               (0x0u<<1)
#define OTG_HCINTMSK13_CHHM_B_0X1                               (0x1u<<1)
#define OTG_HCINTMSK13_XFRCM_B_0X0                              (0x0u<<0)
#define OTG_HCINTMSK13_XFRCM_B_0X1                              (0x1u<<0)

// HCTSIZ13 Configuration

#define OTG_HCTSIZ13_DOPNG                                      (0x1u<<31)
#define OTG_HCTSIZ13_DPID                                       (0x3u<<29)
#define OTG_HCTSIZ13_DPID_0                                     (0x1u<<29)
#define OTG_HCTSIZ13_PKTCNT                                     (0x3FFu<<19)
#define OTG_HCTSIZ13_PKTCNT_0                                   (0x1u<<19)
#define OTG_HCTSIZ13_XFRSIZ                                     (0x7FFFFu<<0)
#define OTG_HCTSIZ13_XFRSIZ_0                                   (0x1u<<0)

#define OTG_HCTSIZ13_DPID_B_0X0                                 (0x0u<<29)
#define OTG_HCTSIZ13_DPID_B_0X1                                 (0x1u<<29)
#define OTG_HCTSIZ13_DPID_B_0X2                                 (0x2u<<29)
#define OTG_HCTSIZ13_DPID_B_0X3                                 (0x3u<<29)

// HCDMA13 Configuration

#define OTG_HCDMA13_DMAADDR                                     (0xFFFFFFFFu<<0)
#define OTG_HCDMA13_DMAADDR_0                                   (0x1u<<0)

// HCCHAR14 Configuration

#define OTG_HCCHAR14_CHENA                                      (0x1u<<31)
#define OTG_HCCHAR14_CHDIS                                      (0x1u<<30)
#define OTG_HCCHAR14_ODDFRM                                     (0x1u<<29)
#define OTG_HCCHAR14_DAD                                        (0x7Fu<<22)
#define OTG_HCCHAR14_DAD_0                                      (0x1u<<22)
#define OTG_HCCHAR14_MCNT                                       (0x3u<<20)
#define OTG_HCCHAR14_MCNT_0                                     (0x1u<<20)
#define OTG_HCCHAR14_EPTYP                                      (0x3u<<18)
#define OTG_HCCHAR14_EPTYP_0                                    (0x1u<<18)
#define OTG_HCCHAR14_LSDEV                                      (0x1u<<17)
#define OTG_HCCHAR14_EPDIR                                      (0x1u<<15)
#define OTG_HCCHAR14_EPNUM                                      (0xFu<<11)
#define OTG_HCCHAR14_EPNUM_0                                    (0x1u<<11)
#define OTG_HCCHAR14_MPSIZ                                      (0x7FFu<<0)
#define OTG_HCCHAR14_MPSIZ_0                                    (0x1u<<0)

#define OTG_HCCHAR14_CHENA_B_0X0                                (0x0u<<31)
#define OTG_HCCHAR14_CHENA_B_0X1                                (0x1u<<31)
#define OTG_HCCHAR14_ODDFRM_B_0X0                               (0x0u<<29)
#define OTG_HCCHAR14_ODDFRM_B_0X1                               (0x1u<<29)
#define OTG_HCCHAR14_MCNT_B_0X0                                 (0x0u<<20)
#define OTG_HCCHAR14_MCNT_B_0X1                                 (0x1u<<20)
#define OTG_HCCHAR14_MCNT_B_0X2                                 (0x2u<<20)
#define OTG_HCCHAR14_MCNT_B_0X3                                 (0x3u<<20)
#define OTG_HCCHAR14_EPTYP_B_0X0                                (0x0u<<18)
#define OTG_HCCHAR14_EPTYP_B_0X1                                (0x1u<<18)
#define OTG_HCCHAR14_EPTYP_B_0X2                                (0x2u<<18)
#define OTG_HCCHAR14_EPTYP_B_0X3                                (0x3u<<18)
#define OTG_HCCHAR14_EPDIR_B_0X0                                (0x0u<<15)
#define OTG_HCCHAR14_EPDIR_B_0X1                                (0x1u<<15)

// HCSPLT14 Configuration

#define OTG_HCSPLT14_SPLITEN                                    (0x1u<<31)
#define OTG_HCSPLT14_COMPLSPLT                                  (0x1u<<16)
#define OTG_HCSPLT14_XACTPOS                                    (0x3u<<14)
#define OTG_HCSPLT14_XACTPOS_0                                  (0x1u<<14)
#define OTG_HCSPLT14_HUBADDR                                    (0x7Fu<<7)
#define OTG_HCSPLT14_HUBADDR_0                                  (0x1u<<7)
#define OTG_HCSPLT14_PRTADDR                                    (0x7Fu<<0)
#define OTG_HCSPLT14_PRTADDR_0                                  (0x1u<<0)

