Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg.h
#define OTG_HCSPLT15_XACTPOS_B_0X3                              (0x3u<<14)
#define OTG_HCSPLT15_XACTPOS_B_0X2                              (0x2u<<14)
#define OTG_HCSPLT15_XACTPOS_B_0X0                              (0x0u<<14)
#define OTG_HCSPLT15_XACTPOS_B_0X1                              (0x1u<<14)

// HCINT15 Configuration

#define OTG_HCINT15_DTERR                                       (0x1u<<10)
#define OTG_HCINT15_FRMOR                                       (0x1u<<9)
#define OTG_HCINT15_BBERR                                       (0x1u<<8)
#define OTG_HCINT15_TXERR                                       (0x1u<<7)
#define OTG_HCINT15_NYET                                        (0x1u<<6)
#define OTG_HCINT15_ACK                                         (0x1u<<5)
#define OTG_HCINT15_NAK                                         (0x1u<<4)
#define OTG_HCINT15_STALL                                       (0x1u<<3)
#define OTG_HCINT15_AHBERR                                      (0x1u<<2)
#define OTG_HCINT15_CHH                                         (0x1u<<1)
#define OTG_HCINT15_XFRC                                        (0x1u<<0)

// HCINTMSK15 Configuration

#define OTG_HCINTMSK15_DTERRM                                   (0x1u<<10)
#define OTG_HCINTMSK15_FRMORM                                   (0x1u<<9)
#define OTG_HCINTMSK15_BBERRM                                   (0x1u<<8)
#define OTG_HCINTMSK15_TXERRM                                   (0x1u<<7)
#define OTG_HCINTMSK15_NYET                                     (0x1u<<6)
#define OTG_HCINTMSK15_ACKM                                     (0x1u<<5)
#define OTG_HCINTMSK15_NAKM                                     (0x1u<<4)
#define OTG_HCINTMSK15_STALLM                                   (0x1u<<3)
#define OTG_HCINTMSK15_AHBERRM                                  (0x1u<<2)
#define OTG_HCINTMSK15_CHHM                                     (0x1u<<1)
#define OTG_HCINTMSK15_XFRCM                                    (0x1u<<0)

#define OTG_HCINTMSK15_DTERRM_B_0X0                             (0x0u<<10)
#define OTG_HCINTMSK15_DTERRM_B_0X1                             (0x1u<<10)
#define OTG_HCINTMSK15_FRMORM_B_0X0                             (0x0u<<9)
#define OTG_HCINTMSK15_FRMORM_B_0X1                             (0x1u<<9)
#define OTG_HCINTMSK15_BBERRM_B_0X0                             (0x0u<<8)
#define OTG_HCINTMSK15_BBERRM_B_0X1                             (0x1u<<8)
#define OTG_HCINTMSK15_TXERRM_B_0X0                             (0x0u<<7)
#define OTG_HCINTMSK15_TXERRM_B_0X1                             (0x1u<<7)
#define OTG_HCINTMSK15_NYET_B_0X0                               (0x0u<<6)
#define OTG_HCINTMSK15_NYET_B_0X1                               (0x1u<<6)
#define OTG_HCINTMSK15_ACKM_B_0X0                               (0x0u<<5)
#define OTG_HCINTMSK15_ACKM_B_0X1                               (0x1u<<5)
#define OTG_HCINTMSK15_NAKM_B_0X0                               (0x0u<<4)
#define OTG_HCINTMSK15_NAKM_B_0X1                               (0x1u<<4)
#define OTG_HCINTMSK15_STALLM_B_0X0                             (0x0u<<3)
#define OTG_HCINTMSK15_STALLM_B_0X1                             (0x1u<<3)
#define OTG_HCINTMSK15_AHBERRM_B_0X0                            (0x0u<<2)
#define OTG_HCINTMSK15_AHBERRM_B_0X1                            (0x1u<<2)
#define OTG_HCINTMSK15_CHHM_B_0X0                               (0x0u<<1)
#define OTG_HCINTMSK15_CHHM_B_0X1                               (0x1u<<1)
#define OTG_HCINTMSK15_XFRCM_B_0X0                              (0x0u<<0)
#define OTG_HCINTMSK15_XFRCM_B_0X1                              (0x1u<<0)

// HCTSIZ15 Configuration

#define OTG_HCTSIZ15_DOPNG                                      (0x1u<<31)
#define OTG_HCTSIZ15_DPID                                       (0x3u<<29)
#define OTG_HCTSIZ15_DPID_0                                     (0x1u<<29)
#define OTG_HCTSIZ15_PKTCNT                                     (0x3FFu<<19)
#define OTG_HCTSIZ15_PKTCNT_0                                   (0x1u<<19)
#define OTG_HCTSIZ15_XFRSIZ                                     (0x7FFFFu<<0)
#define OTG_HCTSIZ15_XFRSIZ_0                                   (0x1u<<0)

#define OTG_HCTSIZ15_DPID_B_0X0                                 (0x0u<<29)
#define OTG_HCTSIZ15_DPID_B_0X1                                 (0x1u<<29)
#define OTG_HCTSIZ15_DPID_B_0X2                                 (0x2u<<29)
#define OTG_HCTSIZ15_DPID_B_0X3                                 (0x3u<<29)

// HCDMA15 Configuration

#define OTG_HCDMA15_DMAADDR                                     (0xFFFFFFFFu<<0)
#define OTG_HCDMA15_DMAADDR_0                                   (0x1u<<0)

// DCFG Configuration

#define OTG_DCFG_PERSCHIVL                                      (0x3u<<24)
#define OTG_DCFG_PERSCHIVL_0                                    (0x1u<<24)
#define OTG_DCFG_ERRATIM                                        (0x1u<<15)
#define OTG_DCFG_PFIVL                                          (0x3u<<11)
#define OTG_DCFG_PFIVL_0                                        (0x1u<<11)
#define OTG_DCFG_DAD                                            (0x7Fu<<4)
#define OTG_DCFG_DAD_0                                          (0x1u<<4)
#define OTG_DCFG_NZLSOHSK                                       (0x1u<<2)
#define OTG_DCFG_DSPD                                           (0x3u<<0)
#define OTG_DCFG_DSPD_0                                         (0x1u<<0)

#define OTG_DCFG_PERSCHIVL_B_0X0                                (0x0u<<24)
#define OTG_DCFG_PERSCHIVL_B_0X1                                (0x1u<<24)
#define OTG_DCFG_PERSCHIVL_B_0X2                                (0x2u<<24)
#define OTG_DCFG_ERRATIM_B_0X1                                  (0x1u<<15)
#define OTG_DCFG_ERRATIM_B_0X0                                  (0x0u<<15)
#define OTG_DCFG_PFIVL_B_0X0                                    (0x0u<<11)
#define OTG_DCFG_PFIVL_B_0X1                                    (0x1u<<11)
#define OTG_DCFG_PFIVL_B_0X2                                    (0x2u<<11)
#define OTG_DCFG_PFIVL_B_0X3                                    (0x3u<<11)
#define OTG_DCFG_NZLSOHSK_B_0X1                                 (0x1u<<2)
#define OTG_DCFG_NZLSOHSK_B_0X0                                 (0x0u<<2)
#define OTG_DCFG_DSPD_B_0X0                                     (0x0u<<0)
#define OTG_DCFG_DSPD_B_0X1                                     (0x1u<<0)

// DCTL Configuration

