Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg.h
#define OTG_DCTL_DSBESLRJCT                                     (0x1u<<18)
#define OTG_DCTL_POPRGDNE                                       (0x1u<<11)
#define OTG_DCTL_CGONAK                                         (0x1u<<10)
#define OTG_DCTL_SGONAK                                         (0x1u<<9)
#define OTG_DCTL_CGINAK                                         (0x1u<<8)
#define OTG_DCTL_SGINAK                                         (0x1u<<7)
#define OTG_DCTL_TCTL                                           (0x7u<<4)
#define OTG_DCTL_TCTL_0                                         (0x1u<<4)
#define OTG_DCTL_GONSTS                                         (0x1u<<3)
#define OTG_DCTL_GINSTS                                         (0x1u<<2)
#define OTG_DCTL_SDIS                                           (0x1u<<1)
#define OTG_DCTL_RWUSIG                                         (0x1u<<0)

#define OTG_DCTL_TCTL_B_0X0                                     (0x0u<<4)
#define OTG_DCTL_TCTL_B_0X1                                     (0x1u<<4)
#define OTG_DCTL_TCTL_B_0X2                                     (0x2u<<4)
#define OTG_DCTL_TCTL_B_0X3                                     (0x3u<<4)
#define OTG_DCTL_TCTL_B_0X4                                     (0x4u<<4)
#define OTG_DCTL_TCTL_B_0X5                                     (0x5u<<4)
#define OTG_DCTL_GONSTS_B_0X0                                   (0x0u<<3)
#define OTG_DCTL_GONSTS_B_0X1                                   (0x1u<<3)
#define OTG_DCTL_GINSTS_B_0X0                                   (0x0u<<2)
#define OTG_DCTL_GINSTS_B_0X1                                   (0x1u<<2)
#define OTG_DCTL_SDIS_B_0X0                                     (0x0u<<1)
#define OTG_DCTL_SDIS_B_0X1                                     (0x1u<<1)

// DSTS Configuration

#define OTG_DSTS_DEVLNSTS                                       (0x3u<<22)
#define OTG_DSTS_DEVLNSTS_0                                     (0x1u<<22)
#define OTG_DSTS_FNSOF                                          (0x3FFFu<<8)
#define OTG_DSTS_FNSOF_0                                        (0x1u<<8)
#define OTG_DSTS_EERR                                           (0x1u<<3)
#define OTG_DSTS_ENUMSPD                                        (0x3u<<1)
#define OTG_DSTS_ENUMSPD_0                                      (0x1u<<1)
#define OTG_DSTS_SUSPSTS                                        (0x1u<<0)

#define OTG_DSTS_ENUMSPD_B_0X0                                  (0x0u<<1)
#define OTG_DSTS_ENUMSPD_B_0X1                                  (0x1u<<1)

// DIEPMSK Configuration

#define OTG_DIEPMSK_NAKM                                        (0x1u<<13)
#define OTG_DIEPMSK_TXFURM                                      (0x1u<<8)
#define OTG_DIEPMSK_INEPNEM                                     (0x1u<<6)
#define OTG_DIEPMSK_INEPNMM                                     (0x1u<<5)
#define OTG_DIEPMSK_ITTXFEMSK                                   (0x1u<<4)
#define OTG_DIEPMSK_TOM                                         (0x1u<<3)
#define OTG_DIEPMSK_AHBERRM                                     (0x1u<<2)
#define OTG_DIEPMSK_EPDM                                        (0x1u<<1)
#define OTG_DIEPMSK_XFRCM                                       (0x1u<<0)

#define OTG_DIEPMSK_NAKM_B_0X0                                  (0x0u<<13)
#define OTG_DIEPMSK_NAKM_B_0X1                                  (0x1u<<13)
#define OTG_DIEPMSK_TXFURM_B_0X0                                (0x0u<<8)
#define OTG_DIEPMSK_TXFURM_B_0X1                                (0x1u<<8)
#define OTG_DIEPMSK_INEPNEM_B_0X0                               (0x0u<<6)
#define OTG_DIEPMSK_INEPNEM_B_0X1                               (0x1u<<6)
#define OTG_DIEPMSK_INEPNMM_B_0X0                               (0x0u<<5)
#define OTG_DIEPMSK_INEPNMM_B_0X1                               (0x1u<<5)
#define OTG_DIEPMSK_ITTXFEMSK_B_0X0                             (0x0u<<4)
#define OTG_DIEPMSK_ITTXFEMSK_B_0X1                             (0x1u<<4)
#define OTG_DIEPMSK_TOM_B_0X0                                   (0x0u<<3)
#define OTG_DIEPMSK_TOM_B_0X1                                   (0x1u<<3)
#define OTG_DIEPMSK_AHBERRM_B_0X0                               (0x0u<<2)
#define OTG_DIEPMSK_AHBERRM_B_0X1                               (0x1u<<2)
#define OTG_DIEPMSK_EPDM_B_0X0                                  (0x0u<<1)
#define OTG_DIEPMSK_EPDM_B_0X1                                  (0x1u<<1)
#define OTG_DIEPMSK_XFRCM_B_0X0                                 (0x0u<<0)
#define OTG_DIEPMSK_XFRCM_B_0X1                                 (0x1u<<0)

// DOEPMSK Configuration

#define OTG_DOEPMSK_NYETMSK                                     (0x1u<<14)
#define OTG_DOEPMSK_NAKMSK                                      (0x1u<<13)
#define OTG_DOEPMSK_BERRM                                       (0x1u<<12)
#define OTG_DOEPMSK_OUTPKTERRM                                  (0x1u<<8)
#define OTG_DOEPMSK_B2BSTUPM                                    (0x1u<<6)
#define OTG_DOEPMSK_STSPHSRXM                                   (0x1u<<5)
#define OTG_DOEPMSK_OTEPDM                                      (0x1u<<4)
#define OTG_DOEPMSK_STUPM                                       (0x1u<<3)
#define OTG_DOEPMSK_AHBERRM                                     (0x1u<<2)
#define OTG_DOEPMSK_EPDM                                        (0x1u<<1)
#define OTG_DOEPMSK_XFRCM                                       (0x1u<<0)

#define OTG_DOEPMSK_NYETMSK_B_0X0                               (0x0u<<14)
#define OTG_DOEPMSK_NYETMSK_B_0X1                               (0x1u<<14)
#define OTG_DOEPMSK_NAKMSK_B_0X0                                (0x0u<<13)
#define OTG_DOEPMSK_NAKMSK_B_0X1                                (0x1u<<13)
#define OTG_DOEPMSK_BERRM_B_0X0                                 (0x0u<<12)
#define OTG_DOEPMSK_BERRM_B_0X1                                 (0x1u<<12)
#define OTG_DOEPMSK_OUTPKTERRM_B_0X0                            (0x0u<<8)
#define OTG_DOEPMSK_OUTPKTERRM_B_0X1                            (0x1u<<8)
#define OTG_DOEPMSK_B2BSTUPM_B_0X0                              (0x0u<<6)
#define OTG_DOEPMSK_B2BSTUPM_B_0X1                              (0x1u<<6)
#define OTG_DOEPMSK_STSPHSRXM_B_0X0                             (0x0u<<5)
#define OTG_DOEPMSK_STSPHSRXM_B_0X1                             (0x1u<<5)
#define OTG_DOEPMSK_OTEPDM_B_0X0                                (0x0u<<4)
#define OTG_DOEPMSK_OTEPDM_B_0X1                                (0x1u<<4)
#define OTG_DOEPMSK_STUPM_B_0X0                                 (0x0u<<3)
#define OTG_DOEPMSK_STUPM_B_0X1                                 (0x1u<<3)
#define OTG_DOEPMSK_AHBERRM_B_0X0                               (0x0u<<2)
#define OTG_DOEPMSK_AHBERRM_B_0X1                               (0x1u<<2)
#define OTG_DOEPMSK_EPDM_B_0X0                                  (0x0u<<1)
#define OTG_DOEPMSK_EPDM_B_0X1                                  (0x1u<<1)
#define OTG_DOEPMSK_XFRCM_B_0X0                                 (0x0u<<0)
#define OTG_DOEPMSK_XFRCM_B_0X1                                 (0x1u<<0)

