Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg.h
// DAINT Configuration

#define OTG_DAINT_OEPINT                                        (0xFFFFu<<16)
#define OTG_DAINT_OEPINT_0                                      (0x1u<<16)
#define OTG_DAINT_IEPINT                                        (0xFFFFu<<0)
#define OTG_DAINT_IEPINT_0                                      (0x1u<<0)

// DAINTMSK Configuration

#define OTG_DAINTMSK_OEPM                                       (0xFFFFu<<16)
#define OTG_DAINTMSK_OEPM_0                                     (0x1u<<16)
#define OTG_DAINTMSK_IEPM                                       (0xFFFFu<<0)
#define OTG_DAINTMSK_IEPM_0                                     (0x1u<<0)

#define OTG_DAINTMSK_OEPM_B_0X0                                 (0x0u<<16)
#define OTG_DAINTMSK_OEPM_B_0X1                                 (0x1u<<16)
#define OTG_DAINTMSK_IEPM_B_0X0                                 (0x0u<<0)
#define OTG_DAINTMSK_IEPM_B_0X1                                 (0x1u<<0)

// DTHRCTL Configuration

#define OTG_DTHRCTL_ARPEN                                       (0x1u<<27)
#define OTG_DTHRCTL_RXTHRLEN                                    (0x1FFu<<17)
#define OTG_DTHRCTL_RXTHRLEN_0                                  (0x1u<<17)
#define OTG_DTHRCTL_RXTHREN                                     (0x1u<<16)
#define OTG_DTHRCTL_TXTHRLEN                                    (0x1FFu<<2)
#define OTG_DTHRCTL_TXTHRLEN_0                                  (0x1u<<2)
#define OTG_DTHRCTL_ISOTHREN                                    (0x1u<<1)
#define OTG_DTHRCTL_NONISOTHREN                                 (0x1u<<0)

// DIEPEMPMSK Configuration

#define OTG_DIEPEMPMSK_INEPTXFEM                                (0xFFFFu<<0)
#define OTG_DIEPEMPMSK_INEPTXFEM_0                              (0x1u<<0)

#define OTG_DIEPEMPMSK_INEPTXFEM_B_0X0                          (0x0u<<0)
#define OTG_DIEPEMPMSK_INEPTXFEM_B_0X1                          (0x1u<<0)

// DIEPCTL0 Configuration

#define OTG_DIEPCTL0_EPENA                                      (0x1u<<31)
#define OTG_DIEPCTL0_EPDIS                                      (0x1u<<30)
#define OTG_DIEPCTL0_SD1PID                                     (0x1u<<29)
#define OTG_DIEPCTL0_SD0PID                                     (0x1u<<28)
#define OTG_DIEPCTL0_SNAK                                       (0x1u<<27)
#define OTG_DIEPCTL0_CNAK                                       (0x1u<<26)
#define OTG_DIEPCTL0_TXFNUM                                     (0xFu<<22)
#define OTG_DIEPCTL0_TXFNUM_0                                   (0x1u<<22)
#define OTG_DIEPCTL0_STALL                                      (0x1u<<21)
#define OTG_DIEPCTL0_EPTYP                                      (0x3u<<18)
#define OTG_DIEPCTL0_EPTYP_0                                    (0x1u<<18)
#define OTG_DIEPCTL0_NAKSTS                                     (0x1u<<17)
#define OTG_DIEPCTL0_DPID                                       (0x1u<<16)
#define OTG_DIEPCTL0_USBAEP                                     (0x1u<<15)
#define OTG_DIEPCTL0_MPSIZ                                      (0x7FFu<<0)
#define OTG_DIEPCTL0_MPSIZ_0                                    (0x1u<<0)

#define OTG_DIEPCTL0_EPTYP_B_0X0                                (0x0u<<18)
#define OTG_DIEPCTL0_EPTYP_B_0X1                                (0x1u<<18)
#define OTG_DIEPCTL0_EPTYP_B_0X2                                (0x2u<<18)
#define OTG_DIEPCTL0_EPTYP_B_0X3                                (0x3u<<18)
#define OTG_DIEPCTL0_NAKSTS_B_0X0                               (0x0u<<17)
#define OTG_DIEPCTL0_NAKSTS_B_0X1                               (0x1u<<17)
#define OTG_DIEPCTL0_DPID_B_0X0                                 (0x0u<<16)
#define OTG_DIEPCTL0_DPID_B_0X1                                 (0x1u<<16)

// DIEPCTL0_ALTERNATE1 Configuration

#define OTG_DIEPCTL0_ALTERNATE1_EPENA                           (0x1u<<31)
#define OTG_DIEPCTL0_ALTERNATE1_EPDIS                           (0x1u<<30)
#define OTG_DIEPCTL0_ALTERNATE1_SODDFRM                         (0x1u<<29)
#define OTG_DIEPCTL0_ALTERNATE1_SEVNFRM                         (0x1u<<28)
#define OTG_DIEPCTL0_ALTERNATE1_SNAK                            (0x1u<<27)
#define OTG_DIEPCTL0_ALTERNATE1_CNAK                            (0x1u<<26)
#define OTG_DIEPCTL0_ALTERNATE1_TXFNUM                          (0xFu<<22)
#define OTG_DIEPCTL0_ALTERNATE1_TXFNUM_0                        (0x1u<<22)
#define OTG_DIEPCTL0_ALTERNATE1_STALL                           (0x1u<<21)
#define OTG_DIEPCTL0_ALTERNATE1_EPTYP                           (0x3u<<18)
#define OTG_DIEPCTL0_ALTERNATE1_EPTYP_0                         (0x1u<<18)
#define OTG_DIEPCTL0_ALTERNATE1_NAKSTS                          (0x1u<<17)
#define OTG_DIEPCTL0_ALTERNATE1_EONUM                           (0x1u<<16)
#define OTG_DIEPCTL0_ALTERNATE1_USBAEP                          (0x1u<<15)
#define OTG_DIEPCTL0_ALTERNATE1_MPSIZ                           (0x7FFu<<0)
#define OTG_DIEPCTL0_ALTERNATE1_MPSIZ_0                         (0x1u<<0)

#define OTG_DIEPCTL0_ALTERNATE1_EPTYP_B_0X0                     (0x0u<<18)
#define OTG_DIEPCTL0_ALTERNATE1_EPTYP_B_0X1                     (0x1u<<18)
#define OTG_DIEPCTL0_ALTERNATE1_EPTYP_B_0X2                     (0x2u<<18)
#define OTG_DIEPCTL0_ALTERNATE1_EPTYP_B_0X3                     (0x3u<<18)
#define OTG_DIEPCTL0_ALTERNATE1_NAKSTS_B_0X0                    (0x0u<<17)
#define OTG_DIEPCTL0_ALTERNATE1_NAKSTS_B_0X1                    (0x1u<<17)
#define OTG_DIEPCTL0_ALTERNATE1_EONUM_B_0X0                     (0x0u<<16)
#define OTG_DIEPCTL0_ALTERNATE1_EONUM_B_0X1                     (0x1u<<16)

// DIEPINT0 Configuration

#define OTG_DIEPINT0_NAK                                        (0x1u<<13)
#define OTG_DIEPINT0_PKTDRPSTS                                  (0x1u<<11)
#define OTG_DIEPINT0_TXFIFOUDRN                                 (0x1u<<8)
#define OTG_DIEPINT0_TXFE                                       (0x1u<<7)
#define OTG_DIEPINT0_INEPNE                                     (0x1u<<6)
#define OTG_DIEPINT0_INEPNM                                     (0x1u<<5)
#define OTG_DIEPINT0_ITTXFE                                     (0x1u<<4)
#define OTG_DIEPINT0_TOC                                        (0x1u<<3)
#define OTG_DIEPINT0_AHBERR                                     (0x1u<<2)
#define OTG_DIEPINT0_EPDISD                                     (0x1u<<1)
#define OTG_DIEPINT0_XFRC                                       (0x1u<<0)

// DIEPTSIZ0 Configuration

