Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg.h
// DIEPDMA1 Configuration

#define OTG_DIEPDMA1_DMAADDR                                    (0xFFFFFFFFu<<0)
#define OTG_DIEPDMA1_DMAADDR_0                                  (0x1u<<0)

// DTXFSTS1 Configuration

#define OTG_DTXFSTS1_INEPTFSAV                                  (0xFFFFu<<0)
#define OTG_DTXFSTS1_INEPTFSAV_0                                (0x1u<<0)

#define OTG_DTXFSTS1_INEPTFSAV_B_0X0                            (0x0u<<0)
#define OTG_DTXFSTS1_INEPTFSAV_B_0X1                            (0x1u<<0)
#define OTG_DTXFSTS1_INEPTFSAV_B_0X2                            (0x2u<<0)

// DIEPCTL2 Configuration

#define OTG_DIEPCTL2_EPENA                                      (0x1u<<31)
#define OTG_DIEPCTL2_EPDIS                                      (0x1u<<30)
#define OTG_DIEPCTL2_SD1PID                                     (0x1u<<29)
#define OTG_DIEPCTL2_SD0PID                                     (0x1u<<28)
#define OTG_DIEPCTL2_SNAK                                       (0x1u<<27)
#define OTG_DIEPCTL2_CNAK                                       (0x1u<<26)
#define OTG_DIEPCTL2_TXFNUM                                     (0xFu<<22)
#define OTG_DIEPCTL2_TXFNUM_0                                   (0x1u<<22)
#define OTG_DIEPCTL2_STALL                                      (0x1u<<21)
#define OTG_DIEPCTL2_EPTYP                                      (0x3u<<18)
#define OTG_DIEPCTL2_EPTYP_0                                    (0x1u<<18)
#define OTG_DIEPCTL2_NAKSTS                                     (0x1u<<17)
#define OTG_DIEPCTL2_DPID                                       (0x1u<<16)
#define OTG_DIEPCTL2_USBAEP                                     (0x1u<<15)
#define OTG_DIEPCTL2_MPSIZ                                      (0x7FFu<<0)
#define OTG_DIEPCTL2_MPSIZ_0                                    (0x1u<<0)

#define OTG_DIEPCTL2_EPTYP_B_0X0                                (0x0u<<18)
#define OTG_DIEPCTL2_EPTYP_B_0X1                                (0x1u<<18)
#define OTG_DIEPCTL2_EPTYP_B_0X2                                (0x2u<<18)
#define OTG_DIEPCTL2_EPTYP_B_0X3                                (0x3u<<18)
#define OTG_DIEPCTL2_NAKSTS_B_0X0                               (0x0u<<17)
#define OTG_DIEPCTL2_NAKSTS_B_0X1                               (0x1u<<17)
#define OTG_DIEPCTL2_DPID_B_0X0                                 (0x0u<<16)
#define OTG_DIEPCTL2_DPID_B_0X1                                 (0x1u<<16)

// DIEPCTL2_ALTERNATE1 Configuration

#define OTG_DIEPCTL2_ALTERNATE1_EPENA                           (0x1u<<31)
#define OTG_DIEPCTL2_ALTERNATE1_EPDIS                           (0x1u<<30)
#define OTG_DIEPCTL2_ALTERNATE1_SODDFRM                         (0x1u<<29)
#define OTG_DIEPCTL2_ALTERNATE1_SEVNFRM                         (0x1u<<28)
#define OTG_DIEPCTL2_ALTERNATE1_SNAK                            (0x1u<<27)
#define OTG_DIEPCTL2_ALTERNATE1_CNAK                            (0x1u<<26)
#define OTG_DIEPCTL2_ALTERNATE1_TXFNUM                          (0xFu<<22)
#define OTG_DIEPCTL2_ALTERNATE1_TXFNUM_0                        (0x1u<<22)
#define OTG_DIEPCTL2_ALTERNATE1_STALL                           (0x1u<<21)
#define OTG_DIEPCTL2_ALTERNATE1_EPTYP                           (0x3u<<18)
#define OTG_DIEPCTL2_ALTERNATE1_EPTYP_0                         (0x1u<<18)
#define OTG_DIEPCTL2_ALTERNATE1_NAKSTS                          (0x1u<<17)
#define OTG_DIEPCTL2_ALTERNATE1_EONUM                           (0x1u<<16)
#define OTG_DIEPCTL2_ALTERNATE1_USBAEP                          (0x1u<<15)
#define OTG_DIEPCTL2_ALTERNATE1_MPSIZ                           (0x7FFu<<0)
#define OTG_DIEPCTL2_ALTERNATE1_MPSIZ_0                         (0x1u<<0)

#define OTG_DIEPCTL2_ALTERNATE1_EPTYP_B_0X0                     (0x0u<<18)
#define OTG_DIEPCTL2_ALTERNATE1_EPTYP_B_0X1                     (0x1u<<18)
#define OTG_DIEPCTL2_ALTERNATE1_EPTYP_B_0X2                     (0x2u<<18)
#define OTG_DIEPCTL2_ALTERNATE1_EPTYP_B_0X3                     (0x3u<<18)
#define OTG_DIEPCTL2_ALTERNATE1_NAKSTS_B_0X0                    (0x0u<<17)
#define OTG_DIEPCTL2_ALTERNATE1_NAKSTS_B_0X1                    (0x1u<<17)
#define OTG_DIEPCTL2_ALTERNATE1_EONUM_B_0X0                     (0x0u<<16)
#define OTG_DIEPCTL2_ALTERNATE1_EONUM_B_0X1                     (0x1u<<16)

// DIEPINT2 Configuration

#define OTG_DIEPINT2_NAK                                        (0x1u<<13)
#define OTG_DIEPINT2_PKTDRPSTS                                  (0x1u<<11)
#define OTG_DIEPINT2_TXFIFOUDRN                                 (0x1u<<8)
#define OTG_DIEPINT2_TXFE                                       (0x1u<<7)
#define OTG_DIEPINT2_INEPNE                                     (0x1u<<6)
#define OTG_DIEPINT2_INEPNM                                     (0x1u<<5)
#define OTG_DIEPINT2_ITTXFE                                     (0x1u<<4)
#define OTG_DIEPINT2_TOC                                        (0x1u<<3)
#define OTG_DIEPINT2_AHBERR                                     (0x1u<<2)
#define OTG_DIEPINT2_EPDISD                                     (0x1u<<1)
#define OTG_DIEPINT2_XFRC                                       (0x1u<<0)

// DIEPTSIZ2 Configuration

#define OTG_DIEPTSIZ2_MCNT                                      (0x3u<<29)
#define OTG_DIEPTSIZ2_MCNT_0                                    (0x1u<<29)
#define OTG_DIEPTSIZ2_PKTCNT                                    (0x3FFu<<19)
#define OTG_DIEPTSIZ2_PKTCNT_0                                  (0x1u<<19)
#define OTG_DIEPTSIZ2_XFRSIZ                                    (0x7FFFFu<<0)
#define OTG_DIEPTSIZ2_XFRSIZ_0                                  (0x1u<<0)

#define OTG_DIEPTSIZ2_MCNT_B_0X1                                (0x1u<<29)
#define OTG_DIEPTSIZ2_MCNT_B_0X2                                (0x2u<<29)
#define OTG_DIEPTSIZ2_MCNT_B_0X3                                (0x3u<<29)

// DIEPDMA2 Configuration

#define OTG_DIEPDMA2_DMAADDR                                    (0xFFFFFFFFu<<0)
#define OTG_DIEPDMA2_DMAADDR_0                                  (0x1u<<0)

// DTXFSTS2 Configuration

#define OTG_DTXFSTS2_INEPTFSAV                                  (0xFFFFu<<0)
#define OTG_DTXFSTS2_INEPTFSAV_0                                (0x1u<<0)

#define OTG_DTXFSTS2_INEPTFSAV_B_0X0                            (0x0u<<0)
#define OTG_DTXFSTS2_INEPTFSAV_B_0X1                            (0x1u<<0)
#define OTG_DTXFSTS2_INEPTFSAV_B_0X2                            (0x2u<<0)

