Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg.h
// DTXFSTS5 Configuration

#define OTG_DTXFSTS5_INEPTFSAV                                  (0xFFFFu<<0)
#define OTG_DTXFSTS5_INEPTFSAV_0                                (0x1u<<0)

#define OTG_DTXFSTS5_INEPTFSAV_B_0X0                            (0x0u<<0)
#define OTG_DTXFSTS5_INEPTFSAV_B_0X1                            (0x1u<<0)
#define OTG_DTXFSTS5_INEPTFSAV_B_0X2                            (0x2u<<0)

// DIEPCTL6 Configuration

#define OTG_DIEPCTL6_EPENA                                      (0x1u<<31)
#define OTG_DIEPCTL6_EPDIS                                      (0x1u<<30)
#define OTG_DIEPCTL6_SD1PID                                     (0x1u<<29)
#define OTG_DIEPCTL6_SD0PID                                     (0x1u<<28)
#define OTG_DIEPCTL6_SNAK                                       (0x1u<<27)
#define OTG_DIEPCTL6_CNAK                                       (0x1u<<26)
#define OTG_DIEPCTL6_TXFNUM                                     (0xFu<<22)
#define OTG_DIEPCTL6_TXFNUM_0                                   (0x1u<<22)
#define OTG_DIEPCTL6_STALL                                      (0x1u<<21)
#define OTG_DIEPCTL6_EPTYP                                      (0x3u<<18)
#define OTG_DIEPCTL6_EPTYP_0                                    (0x1u<<18)
#define OTG_DIEPCTL6_NAKSTS                                     (0x1u<<17)
#define OTG_DIEPCTL6_DPID                                       (0x1u<<16)
#define OTG_DIEPCTL6_USBAEP                                     (0x1u<<15)
#define OTG_DIEPCTL6_MPSIZ                                      (0x7FFu<<0)
#define OTG_DIEPCTL6_MPSIZ_0                                    (0x1u<<0)

#define OTG_DIEPCTL6_EPTYP_B_0X0                                (0x0u<<18)
#define OTG_DIEPCTL6_EPTYP_B_0X1                                (0x1u<<18)
#define OTG_DIEPCTL6_EPTYP_B_0X2                                (0x2u<<18)
#define OTG_DIEPCTL6_EPTYP_B_0X3                                (0x3u<<18)
#define OTG_DIEPCTL6_NAKSTS_B_0X0                               (0x0u<<17)
#define OTG_DIEPCTL6_NAKSTS_B_0X1                               (0x1u<<17)
#define OTG_DIEPCTL6_DPID_B_0X0                                 (0x0u<<16)
#define OTG_DIEPCTL6_DPID_B_0X1                                 (0x1u<<16)

// DIEPCTL6_ALTERNATE1 Configuration

#define OTG_DIEPCTL6_ALTERNATE1_EPENA                           (0x1u<<31)
#define OTG_DIEPCTL6_ALTERNATE1_EPDIS                           (0x1u<<30)
#define OTG_DIEPCTL6_ALTERNATE1_SODDFRM                         (0x1u<<29)
#define OTG_DIEPCTL6_ALTERNATE1_SEVNFRM                         (0x1u<<28)
#define OTG_DIEPCTL6_ALTERNATE1_SNAK                            (0x1u<<27)
#define OTG_DIEPCTL6_ALTERNATE1_CNAK                            (0x1u<<26)
#define OTG_DIEPCTL6_ALTERNATE1_TXFNUM                          (0xFu<<22)
#define OTG_DIEPCTL6_ALTERNATE1_TXFNUM_0                        (0x1u<<22)
#define OTG_DIEPCTL6_ALTERNATE1_STALL                           (0x1u<<21)
#define OTG_DIEPCTL6_ALTERNATE1_EPTYP                           (0x3u<<18)
#define OTG_DIEPCTL6_ALTERNATE1_EPTYP_0                         (0x1u<<18)
#define OTG_DIEPCTL6_ALTERNATE1_NAKSTS                          (0x1u<<17)
#define OTG_DIEPCTL6_ALTERNATE1_EONUM                           (0x1u<<16)
#define OTG_DIEPCTL6_ALTERNATE1_USBAEP                          (0x1u<<15)
#define OTG_DIEPCTL6_ALTERNATE1_MPSIZ                           (0x7FFu<<0)
#define OTG_DIEPCTL6_ALTERNATE1_MPSIZ_0                         (0x1u<<0)

#define OTG_DIEPCTL6_ALTERNATE1_EPTYP_B_0X0                     (0x0u<<18)
#define OTG_DIEPCTL6_ALTERNATE1_EPTYP_B_0X1                     (0x1u<<18)
#define OTG_DIEPCTL6_ALTERNATE1_EPTYP_B_0X2                     (0x2u<<18)
#define OTG_DIEPCTL6_ALTERNATE1_EPTYP_B_0X3                     (0x3u<<18)
#define OTG_DIEPCTL6_ALTERNATE1_NAKSTS_B_0X0                    (0x0u<<17)
#define OTG_DIEPCTL6_ALTERNATE1_NAKSTS_B_0X1                    (0x1u<<17)
#define OTG_DIEPCTL6_ALTERNATE1_EONUM_B_0X0                     (0x0u<<16)
#define OTG_DIEPCTL6_ALTERNATE1_EONUM_B_0X1                     (0x1u<<16)

// DIEPINT6 Configuration

#define OTG_DIEPINT6_NAK                                        (0x1u<<13)
#define OTG_DIEPINT6_PKTDRPSTS                                  (0x1u<<11)
#define OTG_DIEPINT6_TXFIFOUDRN                                 (0x1u<<8)
#define OTG_DIEPINT6_TXFE                                       (0x1u<<7)
#define OTG_DIEPINT6_INEPNE                                     (0x1u<<6)
#define OTG_DIEPINT6_INEPNM                                     (0x1u<<5)
#define OTG_DIEPINT6_ITTXFE                                     (0x1u<<4)
#define OTG_DIEPINT6_TOC                                        (0x1u<<3)
#define OTG_DIEPINT6_AHBERR                                     (0x1u<<2)
#define OTG_DIEPINT6_EPDISD                                     (0x1u<<1)
#define OTG_DIEPINT6_XFRC                                       (0x1u<<0)

// DIEPTSIZ6 Configuration

#define OTG_DIEPTSIZ6_MCNT                                      (0x3u<<29)
#define OTG_DIEPTSIZ6_MCNT_0                                    (0x1u<<29)
#define OTG_DIEPTSIZ6_PKTCNT                                    (0x3FFu<<19)
#define OTG_DIEPTSIZ6_PKTCNT_0                                  (0x1u<<19)
#define OTG_DIEPTSIZ6_XFRSIZ                                    (0x7FFFFu<<0)
#define OTG_DIEPTSIZ6_XFRSIZ_0                                  (0x1u<<0)

#define OTG_DIEPTSIZ6_MCNT_B_0X1                                (0x1u<<29)
#define OTG_DIEPTSIZ6_MCNT_B_0X2                                (0x2u<<29)
#define OTG_DIEPTSIZ6_MCNT_B_0X3                                (0x3u<<29)

// DIEPDMA6 Configuration

#define OTG_DIEPDMA6_DMAADDR                                    (0xFFFFFFFFu<<0)
#define OTG_DIEPDMA6_DMAADDR_0                                  (0x1u<<0)

// DTXFSTS6 Configuration

#define OTG_DTXFSTS6_INEPTFSAV                                  (0xFFFFu<<0)
#define OTG_DTXFSTS6_INEPTFSAV_0                                (0x1u<<0)

#define OTG_DTXFSTS6_INEPTFSAV_B_0X0                            (0x0u<<0)
#define OTG_DTXFSTS6_INEPTFSAV_B_0X1                            (0x1u<<0)
#define OTG_DTXFSTS6_INEPTFSAV_B_0X2                            (0x2u<<0)

// DIEPCTL7 Configuration

#define OTG_DIEPCTL7_EPENA                                      (0x1u<<31)
#define OTG_DIEPCTL7_EPDIS                                      (0x1u<<30)
#define OTG_DIEPCTL7_SD1PID                                     (0x1u<<29)
#define OTG_DIEPCTL7_SD0PID                                     (0x1u<<28)
#define OTG_DIEPCTL7_SNAK                                       (0x1u<<27)
#define OTG_DIEPCTL7_CNAK                                       (0x1u<<26)
#define OTG_DIEPCTL7_TXFNUM                                     (0xFu<<22)
#define OTG_DIEPCTL7_TXFNUM_0                                   (0x1u<<22)
#define OTG_DIEPCTL7_STALL                                      (0x1u<<21)
#define OTG_DIEPCTL7_EPTYP                                      (0x3u<<18)
#define OTG_DIEPCTL7_EPTYP_0                                    (0x1u<<18)
#define OTG_DIEPCTL7_NAKSTS                                     (0x1u<<17)
#define OTG_DIEPCTL7_DPID                                       (0x1u<<16)
#define OTG_DIEPCTL7_USBAEP                                     (0x1u<<15)
#define OTG_DIEPCTL7_MPSIZ                                      (0x7FFu<<0)
#define OTG_DIEPCTL7_MPSIZ_0                                    (0x1u<<0)

#define OTG_DIEPCTL7_EPTYP_B_0X0                                (0x0u<<18)
#define OTG_DIEPCTL7_EPTYP_B_0X1                                (0x1u<<18)
#define OTG_DIEPCTL7_EPTYP_B_0X2                                (0x2u<<18)
#define OTG_DIEPCTL7_EPTYP_B_0X3                                (0x3u<<18)
#define OTG_DIEPCTL7_NAKSTS_B_0X0                               (0x0u<<17)
#define OTG_DIEPCTL7_NAKSTS_B_0X1                               (0x1u<<17)
#define OTG_DIEPCTL7_DPID_B_0X0                                 (0x0u<<16)
#define OTG_DIEPCTL7_DPID_B_0X1                                 (0x1u<<16)

// DIEPCTL7_ALTERNATE1 Configuration

#define OTG_DIEPCTL7_ALTERNATE1_EPENA                           (0x1u<<31)
#define OTG_DIEPCTL7_ALTERNATE1_EPDIS                           (0x1u<<30)
#define OTG_DIEPCTL7_ALTERNATE1_SODDFRM                         (0x1u<<29)
#define OTG_DIEPCTL7_ALTERNATE1_SEVNFRM                         (0x1u<<28)
#define OTG_DIEPCTL7_ALTERNATE1_SNAK                            (0x1u<<27)
#define OTG_DIEPCTL7_ALTERNATE1_CNAK                            (0x1u<<26)
#define OTG_DIEPCTL7_ALTERNATE1_TXFNUM                          (0xFu<<22)
#define OTG_DIEPCTL7_ALTERNATE1_TXFNUM_0                        (0x1u<<22)
#define OTG_DIEPCTL7_ALTERNATE1_STALL                           (0x1u<<21)
#define OTG_DIEPCTL7_ALTERNATE1_EPTYP                           (0x3u<<18)
#define OTG_DIEPCTL7_ALTERNATE1_EPTYP_0                         (0x1u<<18)
#define OTG_DIEPCTL7_ALTERNATE1_NAKSTS                          (0x1u<<17)
#define OTG_DIEPCTL7_ALTERNATE1_EONUM                           (0x1u<<16)
#define OTG_DIEPCTL7_ALTERNATE1_USBAEP                          (0x1u<<15)
#define OTG_DIEPCTL7_ALTERNATE1_MPSIZ                           (0x7FFu<<0)
#define OTG_DIEPCTL7_ALTERNATE1_MPSIZ_0                         (0x1u<<0)

#define OTG_DIEPCTL7_ALTERNATE1_EPTYP_B_0X0                     (0x0u<<18)
#define OTG_DIEPCTL7_ALTERNATE1_EPTYP_B_0X1                     (0x1u<<18)
#define OTG_DIEPCTL7_ALTERNATE1_EPTYP_B_0X2                     (0x2u<<18)
#define OTG_DIEPCTL7_ALTERNATE1_EPTYP_B_0X3                     (0x3u<<18)
#define OTG_DIEPCTL7_ALTERNATE1_NAKSTS_B_0X0                    (0x0u<<17)
#define OTG_DIEPCTL7_ALTERNATE1_NAKSTS_B_0X1                    (0x1u<<17)
#define OTG_DIEPCTL7_ALTERNATE1_EONUM_B_0X0                     (0x0u<<16)
#define OTG_DIEPCTL7_ALTERNATE1_EONUM_B_0X1                     (0x1u<<16)

// DIEPINT7 Configuration

