Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg.h
#define OTG_DIEPINT7_NAK                                        (0x1u<<13)
#define OTG_DIEPINT7_PKTDRPSTS                                  (0x1u<<11)
#define OTG_DIEPINT7_TXFIFOUDRN                                 (0x1u<<8)
#define OTG_DIEPINT7_TXFE                                       (0x1u<<7)
#define OTG_DIEPINT7_INEPNE                                     (0x1u<<6)
#define OTG_DIEPINT7_INEPNM                                     (0x1u<<5)
#define OTG_DIEPINT7_ITTXFE                                     (0x1u<<4)
#define OTG_DIEPINT7_TOC                                        (0x1u<<3)
#define OTG_DIEPINT7_AHBERR                                     (0x1u<<2)
#define OTG_DIEPINT7_EPDISD                                     (0x1u<<1)
#define OTG_DIEPINT7_XFRC                                       (0x1u<<0)

// DIEPTSIZ7 Configuration

#define OTG_DIEPTSIZ7_MCNT                                      (0x3u<<29)
#define OTG_DIEPTSIZ7_MCNT_0                                    (0x1u<<29)
#define OTG_DIEPTSIZ7_PKTCNT                                    (0x3FFu<<19)
#define OTG_DIEPTSIZ7_PKTCNT_0                                  (0x1u<<19)
#define OTG_DIEPTSIZ7_XFRSIZ                                    (0x7FFFFu<<0)
#define OTG_DIEPTSIZ7_XFRSIZ_0                                  (0x1u<<0)

#define OTG_DIEPTSIZ7_MCNT_B_0X1                                (0x1u<<29)
#define OTG_DIEPTSIZ7_MCNT_B_0X2                                (0x2u<<29)
#define OTG_DIEPTSIZ7_MCNT_B_0X3                                (0x3u<<29)

// DIEPDMA7 Configuration

#define OTG_DIEPDMA7_DMAADDR                                    (0xFFFFFFFFu<<0)
#define OTG_DIEPDMA7_DMAADDR_0                                  (0x1u<<0)

// DTXFSTS7 Configuration

#define OTG_DTXFSTS7_INEPTFSAV                                  (0xFFFFu<<0)
#define OTG_DTXFSTS7_INEPTFSAV_0                                (0x1u<<0)

#define OTG_DTXFSTS7_INEPTFSAV_B_0X0                            (0x0u<<0)
#define OTG_DTXFSTS7_INEPTFSAV_B_0X1                            (0x1u<<0)
#define OTG_DTXFSTS7_INEPTFSAV_B_0X2                            (0x2u<<0)

// DIEPCTL8 Configuration

#define OTG_DIEPCTL8_EPENA                                      (0x1u<<31)
#define OTG_DIEPCTL8_EPDIS                                      (0x1u<<30)
#define OTG_DIEPCTL8_SD1PID                                     (0x1u<<29)
#define OTG_DIEPCTL8_SD0PID                                     (0x1u<<28)
#define OTG_DIEPCTL8_SNAK                                       (0x1u<<27)
#define OTG_DIEPCTL8_CNAK                                       (0x1u<<26)
#define OTG_DIEPCTL8_TXFNUM                                     (0xFu<<22)
#define OTG_DIEPCTL8_TXFNUM_0                                   (0x1u<<22)
#define OTG_DIEPCTL8_STALL                                      (0x1u<<21)
#define OTG_DIEPCTL8_EPTYP                                      (0x3u<<18)
#define OTG_DIEPCTL8_EPTYP_0                                    (0x1u<<18)
#define OTG_DIEPCTL8_NAKSTS                                     (0x1u<<17)
#define OTG_DIEPCTL8_DPID                                       (0x1u<<16)
#define OTG_DIEPCTL8_USBAEP                                     (0x1u<<15)
#define OTG_DIEPCTL8_MPSIZ                                      (0x7FFu<<0)
#define OTG_DIEPCTL8_MPSIZ_0                                    (0x1u<<0)

#define OTG_DIEPCTL8_EPTYP_B_0X0                                (0x0u<<18)
#define OTG_DIEPCTL8_EPTYP_B_0X1                                (0x1u<<18)
#define OTG_DIEPCTL8_EPTYP_B_0X2                                (0x2u<<18)
#define OTG_DIEPCTL8_EPTYP_B_0X3                                (0x3u<<18)
#define OTG_DIEPCTL8_NAKSTS_B_0X0                               (0x0u<<17)
#define OTG_DIEPCTL8_NAKSTS_B_0X1                               (0x1u<<17)
#define OTG_DIEPCTL8_DPID_B_0X0                                 (0x0u<<16)
#define OTG_DIEPCTL8_DPID_B_0X1                                 (0x1u<<16)

// DIEPCTL8_ALTERNATE1 Configuration

#define OTG_DIEPCTL8_ALTERNATE1_EPENA                           (0x1u<<31)
#define OTG_DIEPCTL8_ALTERNATE1_EPDIS                           (0x1u<<30)
#define OTG_DIEPCTL8_ALTERNATE1_SODDFRM                         (0x1u<<29)
#define OTG_DIEPCTL8_ALTERNATE1_SEVNFRM                         (0x1u<<28)
#define OTG_DIEPCTL8_ALTERNATE1_SNAK                            (0x1u<<27)
#define OTG_DIEPCTL8_ALTERNATE1_CNAK                            (0x1u<<26)
#define OTG_DIEPCTL8_ALTERNATE1_TXFNUM                          (0xFu<<22)
#define OTG_DIEPCTL8_ALTERNATE1_TXFNUM_0                        (0x1u<<22)
#define OTG_DIEPCTL8_ALTERNATE1_STALL                           (0x1u<<21)
#define OTG_DIEPCTL8_ALTERNATE1_EPTYP                           (0x3u<<18)
#define OTG_DIEPCTL8_ALTERNATE1_EPTYP_0                         (0x1u<<18)
#define OTG_DIEPCTL8_ALTERNATE1_NAKSTS                          (0x1u<<17)
#define OTG_DIEPCTL8_ALTERNATE1_EONUM                           (0x1u<<16)
#define OTG_DIEPCTL8_ALTERNATE1_USBAEP                          (0x1u<<15)
#define OTG_DIEPCTL8_ALTERNATE1_MPSIZ                           (0x7FFu<<0)
#define OTG_DIEPCTL8_ALTERNATE1_MPSIZ_0                         (0x1u<<0)

#define OTG_DIEPCTL8_ALTERNATE1_EPTYP_B_0X0                     (0x0u<<18)
#define OTG_DIEPCTL8_ALTERNATE1_EPTYP_B_0X1                     (0x1u<<18)
#define OTG_DIEPCTL8_ALTERNATE1_EPTYP_B_0X2                     (0x2u<<18)
#define OTG_DIEPCTL8_ALTERNATE1_EPTYP_B_0X3                     (0x3u<<18)
#define OTG_DIEPCTL8_ALTERNATE1_NAKSTS_B_0X0                    (0x0u<<17)
#define OTG_DIEPCTL8_ALTERNATE1_NAKSTS_B_0X1                    (0x1u<<17)
#define OTG_DIEPCTL8_ALTERNATE1_EONUM_B_0X0                     (0x0u<<16)
#define OTG_DIEPCTL8_ALTERNATE1_EONUM_B_0X1                     (0x1u<<16)

// DIEPINT8 Configuration

#define OTG_DIEPINT8_NAK                                        (0x1u<<13)
#define OTG_DIEPINT8_PKTDRPSTS                                  (0x1u<<11)
#define OTG_DIEPINT8_TXFIFOUDRN                                 (0x1u<<8)
#define OTG_DIEPINT8_TXFE                                       (0x1u<<7)
#define OTG_DIEPINT8_INEPNE                                     (0x1u<<6)
#define OTG_DIEPINT8_INEPNM                                     (0x1u<<5)
#define OTG_DIEPINT8_ITTXFE                                     (0x1u<<4)
#define OTG_DIEPINT8_TOC                                        (0x1u<<3)
#define OTG_DIEPINT8_AHBERR                                     (0x1u<<2)
#define OTG_DIEPINT8_EPDISD                                     (0x1u<<1)
#define OTG_DIEPINT8_XFRC                                       (0x1u<<0)

// DIEPTSIZ8 Configuration

#define OTG_DIEPTSIZ8_MCNT                                      (0x3u<<29)
#define OTG_DIEPTSIZ8_MCNT_0                                    (0x1u<<29)
#define OTG_DIEPTSIZ8_PKTCNT                                    (0x3FFu<<19)
#define OTG_DIEPTSIZ8_PKTCNT_0                                  (0x1u<<19)
#define OTG_DIEPTSIZ8_XFRSIZ                                    (0x7FFFFu<<0)
#define OTG_DIEPTSIZ8_XFRSIZ_0                                  (0x1u<<0)

