Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg.h
#define OTG_DIEPTSIZ8_MCNT_B_0X1                                (0x1u<<29)
#define OTG_DIEPTSIZ8_MCNT_B_0X2                                (0x2u<<29)
#define OTG_DIEPTSIZ8_MCNT_B_0X3                                (0x3u<<29)

// DIEPDMA8 Configuration

#define OTG_DIEPDMA8_DMAADDR                                    (0xFFFFFFFFu<<0)
#define OTG_DIEPDMA8_DMAADDR_0                                  (0x1u<<0)

// DTXFSTS8 Configuration

#define OTG_DTXFSTS8_INEPTFSAV                                  (0xFFFFu<<0)
#define OTG_DTXFSTS8_INEPTFSAV_0                                (0x1u<<0)

#define OTG_DTXFSTS8_INEPTFSAV_B_0X0                            (0x0u<<0)
#define OTG_DTXFSTS8_INEPTFSAV_B_0X1                            (0x1u<<0)
#define OTG_DTXFSTS8_INEPTFSAV_B_0X2                            (0x2u<<0)

// DOEPCTL0 Configuration

#define OTG_DOEPCTL0_EPENA                                      (0x1u<<31)
#define OTG_DOEPCTL0_EPDIS                                      (0x1u<<30)
#define OTG_DOEPCTL0_SNAK                                       (0x1u<<27)
#define OTG_DOEPCTL0_CNAK                                       (0x1u<<26)
#define OTG_DOEPCTL0_STALL                                      (0x1u<<21)
#define OTG_DOEPCTL0_SNPM                                       (0x1u<<20)
#define OTG_DOEPCTL0_EPTYP                                      (0x3u<<18)
#define OTG_DOEPCTL0_EPTYP_0                                    (0x1u<<18)
#define OTG_DOEPCTL0_NAKSTS                                     (0x1u<<17)
#define OTG_DOEPCTL0_USBAEP                                     (0x1u<<15)
#define OTG_DOEPCTL0_MPSIZ                                      (0x3u<<0)
#define OTG_DOEPCTL0_MPSIZ_0                                    (0x1u<<0)

#define OTG_DOEPCTL0_NAKSTS_B_0X0                               (0x0u<<17)
#define OTG_DOEPCTL0_NAKSTS_B_0X1                               (0x1u<<17)
#define OTG_DOEPCTL0_MPSIZ_B_0X0                                (0x0u<<0)
#define OTG_DOEPCTL0_MPSIZ_B_0X1                                (0x1u<<0)
#define OTG_DOEPCTL0_MPSIZ_B_0X2                                (0x2u<<0)
#define OTG_DOEPCTL0_MPSIZ_B_0X3                                (0x3u<<0)

// DOEPINT0 Configuration

#define OTG_DOEPINT0_STPKTRX                                    (0x1u<<15)
#define OTG_DOEPINT0_NYET                                       (0x1u<<14)
#define OTG_DOEPINT0_NAK                                        (0x1u<<13)
#define OTG_DOEPINT0_BERR                                       (0x1u<<12)
#define OTG_DOEPINT0_OUTPKTERR                                  (0x1u<<8)
#define OTG_DOEPINT0_B2BSTUP                                    (0x1u<<6)
#define OTG_DOEPINT0_STSPHSRX                                   (0x1u<<5)
#define OTG_DOEPINT0_OTEPDIS                                    (0x1u<<4)
#define OTG_DOEPINT0_STUP                                       (0x1u<<3)
#define OTG_DOEPINT0_AHBERR                                     (0x1u<<2)
#define OTG_DOEPINT0_EPDISD                                     (0x1u<<1)
#define OTG_DOEPINT0_XFRC                                       (0x1u<<0)

// DOEPTSIZ0 Configuration

#define OTG_DOEPTSIZ0_STUPCNT                                   (0x3u<<29)
#define OTG_DOEPTSIZ0_STUPCNT_0                                 (0x1u<<29)
#define OTG_DOEPTSIZ0_PKTCNT                                    (0x1u<<19)
#define OTG_DOEPTSIZ0_XFRSIZ                                    (0x7Fu<<0)
#define OTG_DOEPTSIZ0_XFRSIZ_0                                  (0x1u<<0)

#define OTG_DOEPTSIZ0_STUPCNT_B_0X1                             (0x1u<<29)
#define OTG_DOEPTSIZ0_STUPCNT_B_0X2                             (0x2u<<29)
#define OTG_DOEPTSIZ0_STUPCNT_B_0X3                             (0x3u<<29)

// DOEPDMA0 Configuration

#define OTG_DOEPDMA0_DMAADDR                                    (0xFFFFFFFFu<<0)
#define OTG_DOEPDMA0_DMAADDR_0                                  (0x1u<<0)

// DOEPCTL1 Configuration

#define OTG_DOEPCTL1_EPENA                                      (0x1u<<31)
#define OTG_DOEPCTL1_EPDIS                                      (0x1u<<30)
#define OTG_DOEPCTL1_SD1PID                                     (0x1u<<29)
#define OTG_DOEPCTL1_SD0PID                                     (0x1u<<28)
#define OTG_DOEPCTL1_SNAK                                       (0x1u<<27)
#define OTG_DOEPCTL1_CNAK                                       (0x1u<<26)
#define OTG_DOEPCTL1_STALL                                      (0x1u<<21)
#define OTG_DOEPCTL1_SNPM                                       (0x1u<<20)
#define OTG_DOEPCTL1_EPTYP                                      (0x3u<<18)
#define OTG_DOEPCTL1_EPTYP_0                                    (0x1u<<18)
#define OTG_DOEPCTL1_NAKSTS                                     (0x1u<<17)
#define OTG_DOEPCTL1_DPID                                       (0x1u<<16)
#define OTG_DOEPCTL1_USBAEP                                     (0x1u<<15)
#define OTG_DOEPCTL1_MPSIZ                                      (0x7FFu<<0)
#define OTG_DOEPCTL1_MPSIZ_0                                    (0x1u<<0)

#define OTG_DOEPCTL1_EPTYP_B_0X0                                (0x0u<<18)
#define OTG_DOEPCTL1_EPTYP_B_0X1                                (0x1u<<18)
#define OTG_DOEPCTL1_EPTYP_B_0X2                                (0x2u<<18)
#define OTG_DOEPCTL1_EPTYP_B_0X3                                (0x3u<<18)
#define OTG_DOEPCTL1_NAKSTS_B_0X0                               (0x0u<<17)
#define OTG_DOEPCTL1_NAKSTS_B_0X1                               (0x1u<<17)
#define OTG_DOEPCTL1_DPID_B_0X0                                 (0x0u<<16)
#define OTG_DOEPCTL1_DPID_B_0X1                                 (0x1u<<16)

// DOEPCTL1_ALTERNATE1 Configuration

#define OTG_DOEPCTL1_ALTERNATE1_EPENA                           (0x1u<<31)
#define OTG_DOEPCTL1_ALTERNATE1_EPDIS                           (0x1u<<30)
#define OTG_DOEPCTL1_ALTERNATE1_SODDFRM                         (0x1u<<29)
#define OTG_DOEPCTL1_ALTERNATE1_SEVNFRM                         (0x1u<<28)
#define OTG_DOEPCTL1_ALTERNATE1_SNAK                            (0x1u<<27)
#define OTG_DOEPCTL1_ALTERNATE1_CNAK                            (0x1u<<26)
#define OTG_DOEPCTL1_ALTERNATE1_STALL                           (0x1u<<21)
#define OTG_DOEPCTL1_ALTERNATE1_SNPM                            (0x1u<<20)
#define OTG_DOEPCTL1_ALTERNATE1_EPTYP                           (0x3u<<18)
#define OTG_DOEPCTL1_ALTERNATE1_EPTYP_0                         (0x1u<<18)
#define OTG_DOEPCTL1_ALTERNATE1_NAKSTS                          (0x1u<<17)
#define OTG_DOEPCTL1_ALTERNATE1_EONUM                           (0x1u<<16)
#define OTG_DOEPCTL1_ALTERNATE1_USBAEP                          (0x1u<<15)
#define OTG_DOEPCTL1_ALTERNATE1_MPSIZ                           (0x7FFu<<0)
#define OTG_DOEPCTL1_ALTERNATE1_MPSIZ_0                         (0x1u<<0)

