Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg.h
#define OTG_DOEPCTL1_ALTERNATE1_EPTYP_B_0X0                     (0x0u<<18)
#define OTG_DOEPCTL1_ALTERNATE1_EPTYP_B_0X1                     (0x1u<<18)
#define OTG_DOEPCTL1_ALTERNATE1_EPTYP_B_0X2                     (0x2u<<18)
#define OTG_DOEPCTL1_ALTERNATE1_EPTYP_B_0X3                     (0x3u<<18)
#define OTG_DOEPCTL1_ALTERNATE1_NAKSTS_B_0X0                    (0x0u<<17)
#define OTG_DOEPCTL1_ALTERNATE1_NAKSTS_B_0X1                    (0x1u<<17)
#define OTG_DOEPCTL1_ALTERNATE1_EONUM_B_0X0                     (0x0u<<16)
#define OTG_DOEPCTL1_ALTERNATE1_EONUM_B_0X1                     (0x1u<<16)

// DOEPINT1 Configuration

#define OTG_DOEPINT1_STPKTRX                                    (0x1u<<15)
#define OTG_DOEPINT1_NYET                                       (0x1u<<14)
#define OTG_DOEPINT1_NAK                                        (0x1u<<13)
#define OTG_DOEPINT1_BERR                                       (0x1u<<12)
#define OTG_DOEPINT1_OUTPKTERR                                  (0x1u<<8)
#define OTG_DOEPINT1_B2BSTUP                                    (0x1u<<6)
#define OTG_DOEPINT1_STSPHSRX                                   (0x1u<<5)
#define OTG_DOEPINT1_OTEPDIS                                    (0x1u<<4)
#define OTG_DOEPINT1_STUP                                       (0x1u<<3)
#define OTG_DOEPINT1_AHBERR                                     (0x1u<<2)
#define OTG_DOEPINT1_EPDISD                                     (0x1u<<1)
#define OTG_DOEPINT1_XFRC                                       (0x1u<<0)

// DOEPTSIZ1 Configuration

#define OTG_DOEPTSIZ1_RXDPID                                    (0x3u<<29)
#define OTG_DOEPTSIZ1_RXDPID_0                                  (0x1u<<29)
#define OTG_DOEPTSIZ1_PKTCNT                                    (0x3FFu<<19)
#define OTG_DOEPTSIZ1_PKTCNT_0                                  (0x1u<<19)
#define OTG_DOEPTSIZ1_XFRSIZ                                    (0x7FFFFu<<0)
#define OTG_DOEPTSIZ1_XFRSIZ_0                                  (0x1u<<0)

#define OTG_DOEPTSIZ1_RXDPID_B_0X0_ISOCHRONOUS_OUT_ENDPOINTS    (0x0u<<29)
#define OTG_DOEPTSIZ1_RXDPID_B_0X1_ISOCHRONOUS_OUT_ENDPOINTS    (0x1u<<29)
#define OTG_DOEPTSIZ1_RXDPID_B_0X2_ISOCHRONOUS_OUT_ENDPOINTS    (0x2u<<29)
#define OTG_DOEPTSIZ1_RXDPID_B_0X3_ISOCHRONOUS_OUT_ENDPOINTS    (0x3u<<29)

// DOEPDMA1 Configuration

#define OTG_DOEPDMA1_DMAADDR                                    (0xFFFFFFFFu<<0)
#define OTG_DOEPDMA1_DMAADDR_0                                  (0x1u<<0)

// DOEPCTL2 Configuration

#define OTG_DOEPCTL2_EPENA                                      (0x1u<<31)
#define OTG_DOEPCTL2_EPDIS                                      (0x1u<<30)
#define OTG_DOEPCTL2_SD1PID                                     (0x1u<<29)
#define OTG_DOEPCTL2_SD0PID                                     (0x1u<<28)
#define OTG_DOEPCTL2_SNAK                                       (0x1u<<27)
#define OTG_DOEPCTL2_CNAK                                       (0x1u<<26)
#define OTG_DOEPCTL2_STALL                                      (0x1u<<21)
#define OTG_DOEPCTL2_SNPM                                       (0x1u<<20)
#define OTG_DOEPCTL2_EPTYP                                      (0x3u<<18)
#define OTG_DOEPCTL2_EPTYP_0                                    (0x1u<<18)
#define OTG_DOEPCTL2_NAKSTS                                     (0x1u<<17)
#define OTG_DOEPCTL2_DPID                                       (0x1u<<16)
#define OTG_DOEPCTL2_USBAEP                                     (0x1u<<15)
#define OTG_DOEPCTL2_MPSIZ                                      (0x7FFu<<0)
#define OTG_DOEPCTL2_MPSIZ_0                                    (0x1u<<0)

#define OTG_DOEPCTL2_EPTYP_B_0X0                                (0x0u<<18)
#define OTG_DOEPCTL2_EPTYP_B_0X1                                (0x1u<<18)
#define OTG_DOEPCTL2_EPTYP_B_0X2                                (0x2u<<18)
#define OTG_DOEPCTL2_EPTYP_B_0X3                                (0x3u<<18)
#define OTG_DOEPCTL2_NAKSTS_B_0X0                               (0x0u<<17)
#define OTG_DOEPCTL2_NAKSTS_B_0X1                               (0x1u<<17)
#define OTG_DOEPCTL2_DPID_B_0X0                                 (0x0u<<16)
#define OTG_DOEPCTL2_DPID_B_0X1                                 (0x1u<<16)

// DOEPCTL2_ALTERNATE1 Configuration

#define OTG_DOEPCTL2_ALTERNATE1_EPENA                           (0x1u<<31)
#define OTG_DOEPCTL2_ALTERNATE1_EPDIS                           (0x1u<<30)
#define OTG_DOEPCTL2_ALTERNATE1_SODDFRM                         (0x1u<<29)
#define OTG_DOEPCTL2_ALTERNATE1_SEVNFRM                         (0x1u<<28)
#define OTG_DOEPCTL2_ALTERNATE1_SNAK                            (0x1u<<27)
#define OTG_DOEPCTL2_ALTERNATE1_CNAK                            (0x1u<<26)
#define OTG_DOEPCTL2_ALTERNATE1_STALL                           (0x1u<<21)
#define OTG_DOEPCTL2_ALTERNATE1_SNPM                            (0x1u<<20)
#define OTG_DOEPCTL2_ALTERNATE1_EPTYP                           (0x3u<<18)
#define OTG_DOEPCTL2_ALTERNATE1_EPTYP_0                         (0x1u<<18)
#define OTG_DOEPCTL2_ALTERNATE1_NAKSTS                          (0x1u<<17)
#define OTG_DOEPCTL2_ALTERNATE1_EONUM                           (0x1u<<16)
#define OTG_DOEPCTL2_ALTERNATE1_USBAEP                          (0x1u<<15)
#define OTG_DOEPCTL2_ALTERNATE1_MPSIZ                           (0x7FFu<<0)
#define OTG_DOEPCTL2_ALTERNATE1_MPSIZ_0                         (0x1u<<0)

#define OTG_DOEPCTL2_ALTERNATE1_EPTYP_B_0X0                     (0x0u<<18)
#define OTG_DOEPCTL2_ALTERNATE1_EPTYP_B_0X1                     (0x1u<<18)
#define OTG_DOEPCTL2_ALTERNATE1_EPTYP_B_0X2                     (0x2u<<18)
#define OTG_DOEPCTL2_ALTERNATE1_EPTYP_B_0X3                     (0x3u<<18)
#define OTG_DOEPCTL2_ALTERNATE1_NAKSTS_B_0X0                    (0x0u<<17)
#define OTG_DOEPCTL2_ALTERNATE1_NAKSTS_B_0X1                    (0x1u<<17)
#define OTG_DOEPCTL2_ALTERNATE1_EONUM_B_0X0                     (0x0u<<16)
#define OTG_DOEPCTL2_ALTERNATE1_EONUM_B_0X1                     (0x1u<<16)

