Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_otg.h
// DOEPCTL5 Configuration

#define OTG_DOEPCTL5_EPENA                                      (0x1u<<31)
#define OTG_DOEPCTL5_EPDIS                                      (0x1u<<30)
#define OTG_DOEPCTL5_SD1PID                                     (0x1u<<29)
#define OTG_DOEPCTL5_SD0PID                                     (0x1u<<28)
#define OTG_DOEPCTL5_SNAK                                       (0x1u<<27)
#define OTG_DOEPCTL5_CNAK                                       (0x1u<<26)
#define OTG_DOEPCTL5_STALL                                      (0x1u<<21)
#define OTG_DOEPCTL5_SNPM                                       (0x1u<<20)
#define OTG_DOEPCTL5_EPTYP                                      (0x3u<<18)
#define OTG_DOEPCTL5_EPTYP_0                                    (0x1u<<18)
#define OTG_DOEPCTL5_NAKSTS                                     (0x1u<<17)
#define OTG_DOEPCTL5_DPID                                       (0x1u<<16)
#define OTG_DOEPCTL5_USBAEP                                     (0x1u<<15)
#define OTG_DOEPCTL5_MPSIZ                                      (0x7FFu<<0)
#define OTG_DOEPCTL5_MPSIZ_0                                    (0x1u<<0)

#define OTG_DOEPCTL5_EPTYP_B_0X0                                (0x0u<<18)
#define OTG_DOEPCTL5_EPTYP_B_0X1                                (0x1u<<18)
#define OTG_DOEPCTL5_EPTYP_B_0X2                                (0x2u<<18)
#define OTG_DOEPCTL5_EPTYP_B_0X3                                (0x3u<<18)
#define OTG_DOEPCTL5_NAKSTS_B_0X0                               (0x0u<<17)
#define OTG_DOEPCTL5_NAKSTS_B_0X1                               (0x1u<<17)
#define OTG_DOEPCTL5_DPID_B_0X0                                 (0x0u<<16)
#define OTG_DOEPCTL5_DPID_B_0X1                                 (0x1u<<16)

// DOEPCTL5_ALTERNATE1 Configuration

#define OTG_DOEPCTL5_ALTERNATE1_EPENA                           (0x1u<<31)
#define OTG_DOEPCTL5_ALTERNATE1_EPDIS                           (0x1u<<30)
#define OTG_DOEPCTL5_ALTERNATE1_SODDFRM                         (0x1u<<29)
#define OTG_DOEPCTL5_ALTERNATE1_SEVNFRM                         (0x1u<<28)
#define OTG_DOEPCTL5_ALTERNATE1_SNAK                            (0x1u<<27)
#define OTG_DOEPCTL5_ALTERNATE1_CNAK                            (0x1u<<26)
#define OTG_DOEPCTL5_ALTERNATE1_STALL                           (0x1u<<21)
#define OTG_DOEPCTL5_ALTERNATE1_SNPM                            (0x1u<<20)
#define OTG_DOEPCTL5_ALTERNATE1_EPTYP                           (0x3u<<18)
#define OTG_DOEPCTL5_ALTERNATE1_EPTYP_0                         (0x1u<<18)
#define OTG_DOEPCTL5_ALTERNATE1_NAKSTS                          (0x1u<<17)
#define OTG_DOEPCTL5_ALTERNATE1_EONUM                           (0x1u<<16)
#define OTG_DOEPCTL5_ALTERNATE1_USBAEP                          (0x1u<<15)
#define OTG_DOEPCTL5_ALTERNATE1_MPSIZ                           (0x7FFu<<0)
#define OTG_DOEPCTL5_ALTERNATE1_MPSIZ_0                         (0x1u<<0)

#define OTG_DOEPCTL5_ALTERNATE1_EPTYP_B_0X0                     (0x0u<<18)
#define OTG_DOEPCTL5_ALTERNATE1_EPTYP_B_0X1                     (0x1u<<18)
#define OTG_DOEPCTL5_ALTERNATE1_EPTYP_B_0X2                     (0x2u<<18)
#define OTG_DOEPCTL5_ALTERNATE1_EPTYP_B_0X3                     (0x3u<<18)
#define OTG_DOEPCTL5_ALTERNATE1_NAKSTS_B_0X0                    (0x0u<<17)
#define OTG_DOEPCTL5_ALTERNATE1_NAKSTS_B_0X1                    (0x1u<<17)
#define OTG_DOEPCTL5_ALTERNATE1_EONUM_B_0X0                     (0x0u<<16)
#define OTG_DOEPCTL5_ALTERNATE1_EONUM_B_0X1                     (0x1u<<16)

// DOEPINT5 Configuration

#define OTG_DOEPINT5_STPKTRX                                    (0x1u<<15)
#define OTG_DOEPINT5_NYET                                       (0x1u<<14)
#define OTG_DOEPINT5_NAK                                        (0x1u<<13)
#define OTG_DOEPINT5_BERR                                       (0x1u<<12)
#define OTG_DOEPINT5_OUTPKTERR                                  (0x1u<<8)
#define OTG_DOEPINT5_B2BSTUP                                    (0x1u<<6)
#define OTG_DOEPINT5_STSPHSRX                                   (0x1u<<5)
#define OTG_DOEPINT5_OTEPDIS                                    (0x1u<<4)
#define OTG_DOEPINT5_STUP                                       (0x1u<<3)
#define OTG_DOEPINT5_AHBERR                                     (0x1u<<2)
#define OTG_DOEPINT5_EPDISD                                     (0x1u<<1)
#define OTG_DOEPINT5_XFRC                                       (0x1u<<0)

// DOEPTSIZ5 Configuration

#define OTG_DOEPTSIZ5_RXDPID                                    (0x3u<<29)
#define OTG_DOEPTSIZ5_RXDPID_0                                  (0x1u<<29)
#define OTG_DOEPTSIZ5_PKTCNT                                    (0x3FFu<<19)
#define OTG_DOEPTSIZ5_PKTCNT_0                                  (0x1u<<19)
#define OTG_DOEPTSIZ5_XFRSIZ                                    (0x7FFFFu<<0)
#define OTG_DOEPTSIZ5_XFRSIZ_0                                  (0x1u<<0)

#define OTG_DOEPTSIZ5_RXDPID_B_0X0_ISOCHRONOUS_OUT_ENDPOINTS    (0x0u<<29)
#define OTG_DOEPTSIZ5_RXDPID_B_0X1_ISOCHRONOUS_OUT_ENDPOINTS    (0x1u<<29)
#define OTG_DOEPTSIZ5_RXDPID_B_0X2_ISOCHRONOUS_OUT_ENDPOINTS    (0x2u<<29)
#define OTG_DOEPTSIZ5_RXDPID_B_0X3_ISOCHRONOUS_OUT_ENDPOINTS    (0x3u<<29)

// DOEPDMA5 Configuration

#define OTG_DOEPDMA5_DMAADDR                                    (0xFFFFFFFFu<<0)
#define OTG_DOEPDMA5_DMAADDR_0                                  (0x1u<<0)

// DOEPCTL6 Configuration

#define OTG_DOEPCTL6_EPENA                                      (0x1u<<31)
#define OTG_DOEPCTL6_EPDIS                                      (0x1u<<30)
#define OTG_DOEPCTL6_SD1PID                                     (0x1u<<29)
#define OTG_DOEPCTL6_SD0PID                                     (0x1u<<28)
#define OTG_DOEPCTL6_SNAK                                       (0x1u<<27)
#define OTG_DOEPCTL6_CNAK                                       (0x1u<<26)
#define OTG_DOEPCTL6_STALL                                      (0x1u<<21)
#define OTG_DOEPCTL6_SNPM                                       (0x1u<<20)
#define OTG_DOEPCTL6_EPTYP                                      (0x3u<<18)
#define OTG_DOEPCTL6_EPTYP_0                                    (0x1u<<18)
#define OTG_DOEPCTL6_NAKSTS                                     (0x1u<<17)
#define OTG_DOEPCTL6_DPID                                       (0x1u<<16)
#define OTG_DOEPCTL6_USBAEP                                     (0x1u<<15)
#define OTG_DOEPCTL6_MPSIZ                                      (0x7FFu<<0)
#define OTG_DOEPCTL6_MPSIZ_0                                    (0x1u<<0)

